GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: DMAnDPTRH
#define DMAnDPTRH DMAnDPTRH
DMAnDPTRH                                equ 00EDh
// bitfield definitions
DMAnDPTRH_DPTR_POSN                      equ 0000h
DMAnDPTRH_DPTR_POSITION                  equ 0000h
DMAnDPTRH_DPTR_SIZE                      equ 0008h
DMAnDPTRH_DPTR_LENGTH                    equ 0008h
DMAnDPTRH_DPTR_MASK                      equ 00FFh
DMAnDPTRH_DPTR8_POSN                     equ 0000h
DMAnDPTRH_DPTR8_POSITION                 equ 0000h
DMAnDPTRH_DPTR8_SIZE                     equ 0001h
DMAnDPTRH_DPTR8_LENGTH                   equ 0001h
DMAnDPTRH_DPTR8_MASK                     equ 0001h
DMAnDPTRH_DPTR9_POSN                     equ 0001h
DMAnDPTRH_DPTR9_POSITION                 equ 0001h
DMAnDPTRH_DPTR9_SIZE                     equ 0001h
DMAnDPTRH_DPTR9_LENGTH                   equ 0001h
DMAnDPTRH_DPTR9_MASK                     equ 0002h
DMAnDPTRH_DPTR10_POSN                    equ 0002h
DMAnDPTRH_DPTR10_POSITION                equ 0002h
DMAnDPTRH_DPTR10_SIZE                    equ 0001h
DMAnDPTRH_DPTR10_LENGTH                  equ 0001h
DMAnDPTRH_DPTR10_MASK                    equ 0004h
DMAnDPTRH_DPTR11_POSN                    equ 0003h
DMAnDPTRH_DPTR11_POSITION                equ 0003h
DMAnDPTRH_DPTR11_SIZE                    equ 0001h
DMAnDPTRH_DPTR11_LENGTH                  equ 0001h
DMAnDPTRH_DPTR11_MASK                    equ 0008h
DMAnDPTRH_DPTR12_POSN                    equ 0004h
DMAnDPTRH_DPTR12_POSITION                equ 0004h
DMAnDPTRH_DPTR12_SIZE                    equ 0001h
DMAnDPTRH_DPTR12_LENGTH                  equ 0001h
DMAnDPTRH_DPTR12_MASK                    equ 0010h
DMAnDPTRH_DPTR13_POSN                    equ 0005h
DMAnDPTRH_DPTR13_POSITION                equ 0005h
DMAnDPTRH_DPTR13_SIZE                    equ 0001h
DMAnDPTRH_DPTR13_LENGTH                  equ 0001h
DMAnDPTRH_DPTR13_MASK                    equ 0020h
DMAnDPTRH_DPTR14_POSN                    equ 0006h
DMAnDPTRH_DPTR14_POSITION                equ 0006h
DMAnDPTRH_DPTR14_SIZE                    equ 0001h
DMAnDPTRH_DPTR14_LENGTH                  equ 0001h
DMAnDPTRH_DPTR14_MASK                    equ 0040h
DMAnDPTRH_DPTR15_POSN                    equ 0007h
DMAnDPTRH_DPTR15_POSITION                equ 0007h
DMAnDPTRH_DPTR15_SIZE                    equ 0001h
DMAnDPTRH_DPTR15_LENGTH                  equ 0001h
DMAnDPTRH_DPTR15_MASK                    equ 0080h

// Register: DMAnDSZ
#define DMAnDSZ DMAnDSZ
DMAnDSZ                                  equ 00EEh

// Register: DMAnDSZL
#define DMAnDSZL DMAnDSZL
DMAnDSZL                                 equ 00EEh
// bitfield definitions
DMAnDSZL_DSZ_POSN                        equ 0000h
DMAnDSZL_DSZ_POSITION                    equ 0000h
DMAnDSZL_DSZ_SIZE                        equ 0008h
DMAnDSZL_DSZ_LENGTH                      equ 0008h
DMAnDSZL_DSZ_MASK                        equ 00FFh
DMAnDSZL_DSZ0_POSN                       equ 0000h
DMAnDSZL_DSZ0_POSITION                   equ 0000h
DMAnDSZL_DSZ0_SIZE                       equ 0001h
DMAnDSZL_DSZ0_LENGTH                     equ 0001h
DMAnDSZL_DSZ0_MASK                       equ 0001h
DMAnDSZL_DSZ1_POSN                       equ 0001h
DMAnDSZL_DSZ1_POSITION                   equ 0001h
DMAnDSZL_DSZ1_SIZE                       equ 0001h
DMAnDSZL_DSZ1_LENGTH                     equ 0001h
DMAnDSZL_DSZ1_MASK                       equ 0002h
DMAnDSZL_DSZ2_POSN                       equ 0002h
DMAnDSZL_DSZ2_POSITION                   equ 0002h
DMAnDSZL_DSZ2_SIZE                       equ 0001h
DMAnDSZL_DSZ2_LENGTH                     equ 0001h
DMAnDSZL_DSZ2_MASK                       equ 0004h
DMAnDSZL_DSZ3_POSN                       equ 0003h
DMAnDSZL_DSZ3_POSITION                   equ 0003h
DMAnDSZL_DSZ3_SIZE                       equ 0001h
DMAnDSZL_DSZ3_LENGTH                     equ 0001h
DMAnDSZL_DSZ3_MASK                       equ 0008h
DMAnDSZL_DSZ4_POSN                       equ 0004h
DMAnDSZL_DSZ4_POSITION                   equ 0004h
DMAnDSZL_DSZ4_SIZE                       equ 0001h
DMAnDSZL_DSZ4_LENGTH                     equ 0001h
DMAnDSZL_DSZ4_MASK                       equ 0010h
DMAnDSZL_DSZ5_POSN                       equ 0005h
DMAnDSZL_DSZ5_POSITION                   equ 0005h
DMAnDSZL_DSZ5_SIZE                       equ 0001h
DMAnDSZL_DSZ5_LENGTH                     equ 0001h
DMAnDSZL_DSZ5_MASK                       equ 0020h
DMAnDSZL_DSZ6_POSN                       equ 0006h
DMAnDSZL_DSZ6_POSITION                   equ 0006h
DMAnDSZL_DSZ6_SIZE                       equ 0001h
DMAnDSZL_DSZ6_LENGTH                     equ 0001h
DMAnDSZL_DSZ6_MASK                       equ 0040h
DMAnDSZL_DSZ7_POSN                       equ 0007h
DMAnDSZL_DSZ7_POSITION                   equ 0007h
DMAnDSZL_DSZ7_SIZE                       equ 0001h
DMAnDSZL_DSZ7_LENGTH                     equ 0001h
DMAnDSZL_DSZ7_MASK                       equ 0080h

// Register: DMAnDSZH
#define DMAnDSZH DMAnDSZH
DMAnDSZH                                 equ 00EFh
// bitfield definitions
DMAnDSZH_DSZ_POSN                        equ 0000h
DMAnDSZH_DSZ_POSITION                    equ 0000h
DMAnDSZH_DSZ_SIZE                        equ 0008h
DMAnDSZH_DSZ_LENGTH                      equ 0008h
DMAnDSZH_DSZ_MASK                        equ 00FFh
DMAnDSZH_DSZ8_POSN                       equ 0000h
DMAnDSZH_DSZ8_POSITION                   equ 0000h
DMAnDSZH_DSZ8_SIZE                       equ 0001h
DMAnDSZH_DSZ8_LENGTH                     equ 0001h
DMAnDSZH_DSZ8_MASK                       equ 0001h
DMAnDSZH_DSZ9_POSN                       equ 0001h
DMAnDSZH_DSZ9_POSITION                   equ 0001h
DMAnDSZH_DSZ9_SIZE                       equ 0001h
DMAnDSZH_DSZ9_LENGTH                     equ 0001h
DMAnDSZH_DSZ9_MASK                       equ 0002h
DMAnDSZH_DSZ10_POSN                      equ 0002h
DMAnDSZH_DSZ10_POSITION                  equ 0002h
DMAnDSZH_DSZ10_SIZE                      equ 0001h
DMAnDSZH_DSZ10_LENGTH                    equ 0001h
DMAnDSZH_DSZ10_MASK                      equ 0004h
DMAnDSZH_DSZ11_POSN                      equ 0003h
DMAnDSZH_DSZ11_POSITION                  equ 0003h
DMAnDSZH_DSZ11_SIZE                      equ 0001h
DMAnDSZH_DSZ11_LENGTH                    equ 0001h
DMAnDSZH_DSZ11_MASK                      equ 0008h

// Register: DMAnDSA
#define DMAnDSA DMAnDSA
DMAnDSA                                  equ 00F0h

// Register: DMAnDSAL
#define DMAnDSAL DMAnDSAL
DMAnDSAL                                 equ 00F0h
// bitfield definitions
DMAnDSAL_DSA_POSN                        equ 0000h
DMAnDSAL_DSA_POSITION                    equ 0000h
DMAnDSAL_DSA_SIZE                        equ 0008h
DMAnDSAL_DSA_LENGTH                      equ 0008h
DMAnDSAL_DSA_MASK                        equ 00FFh
DMAnDSAL_DSA0_POSN                       equ 0000h
DMAnDSAL_DSA0_POSITION                   equ 0000h
DMAnDSAL_DSA0_SIZE                       equ 0001h
DMAnDSAL_DSA0_LENGTH                     equ 0001h
DMAnDSAL_DSA0_MASK                       equ 0001h
DMAnDSAL_DSA1_POSN                       equ 0001h
DMAnDSAL_DSA1_POSITION                   equ 0001h
DMAnDSAL_DSA1_SIZE                       equ 0001h
DMAnDSAL_DSA1_LENGTH                     equ 0001h
DMAnDSAL_DSA1_MASK                       equ 0002h
DMAnDSAL_DSA2_POSN                       equ 0002h
DMAnDSAL_DSA2_POSITION                   equ 0002h
DMAnDSAL_DSA2_SIZE                       equ 0001h
DMAnDSAL_DSA2_LENGTH                     equ 0001h
DMAnDSAL_DSA2_MASK                       equ 0004h
DMAnDSAL_DSA3_POSN                       equ 0003h
DMAnDSAL_DSA3_POSITION                   equ 0003h
DMAnDSAL_DSA3_SIZE                       equ 0001h
DMAnDSAL_DSA3_LENGTH                     equ 0001h
DMAnDSAL_DSA3_MASK                       equ 0008h
DMAnDSAL_DSA4_POSN                       equ 0004h
DMAnDSAL_DSA4_POSITION                   equ 0004h
DMAnDSAL_DSA4_SIZE                       equ 0001h
DMAnDSAL_DSA4_LENGTH                     equ 0001h
DMAnDSAL_DSA4_MASK                       equ 0010h
DMAnDSAL_DSA5_POSN                       equ 0005h
DMAnDSAL_DSA5_POSITION                   equ 0005h
DMAnDSAL_DSA5_SIZE                       equ 0001h
DMAnDSAL_DSA5_LENGTH                     equ 0001h
DMAnDSAL_DSA5_MASK                       equ 0020h
DMAnDSAL_DSA6_POSN                       equ 0006h
DMAnDSAL_DSA6_POSITION                   equ 0006h
DMAnDSAL_DSA6_SIZE                       equ 0001h
DMAnDSAL_DSA6_LENGTH                     equ 0001h
DMAnDSAL_DSA6_MASK                       equ 0040h
DMAnDSAL_DSA7_POSN                       equ 0007h
DMAnDSAL_DSA7_POSITION                   equ 0007h
DMAnDSAL_DSA7_SIZE                       equ 0001h
DMAnDSAL_DSA7_LENGTH                     equ 0001h
DMAnDSAL_DSA7_MASK                       equ 0080h

// Register: DMAnDSAH
#define DMAnDSAH DMAnDSAH
DMAnDSAH                                 equ 00F1h
// bitfield definitions
DMAnDSAH_DSA_POSN                        equ 0000h
DMAnDSAH_DSA_POSITION                    equ 0000h
DMAnDSAH_DSA_SIZE                        equ 0008h
DMAnDSAH_DSA_LENGTH                      equ 0008h
DMAnDSAH_DSA_MASK                        equ 00FFh
DMAnDSAH_DSA8_POSN                       equ 0000h
DMAnDSAH_DSA8_POSITION                   equ 0000h
DMAnDSAH_DSA8_SIZE                       equ 0001h
DMAnDSAH_DSA8_LENGTH                     equ 0001h
DMAnDSAH_DSA8_MASK                       equ 0001h
DMAnDSAH_DSA9_POSN                       equ 0001h
DMAnDSAH_DSA9_POSITION                   equ 0001h
DMAnDSAH_DSA9_SIZE                       equ 0001h
DMAnDSAH_DSA9_LENGTH                     equ 0001h
DMAnDSAH_DSA9_MASK                       equ 0002h
DMAnDSAH_DSA10_POSN                      equ 0002h
DMAnDSAH_DSA10_POSITION                  equ 0002h
DMAnDSAH_DSA10_SIZE                      equ 0001h
DMAnDSAH_DSA10_LENGTH                    equ 0001h
DMAnDSAH_DSA10_MASK                      equ 0004h
DMAnDSAH_DSA11_POSN                      equ 0003h
DMAnDSAH_DSA11_POSITION                  equ 0003h
DMAnDSAH_DSA11_SIZE                      equ 0001h
DMAnDSAH_DSA11_LENGTH                    equ 0001h
DMAnDSAH_DSA11_MASK                      equ 0008h
DMAnDSAH_DSA12_POSN                      equ 0004h
DMAnDSAH_DSA12_POSITION                  equ 0004h
DMAnDSAH_DSA12_SIZE                      equ 0001h
DMAnDSAH_DSA12_LENGTH                    equ 0001h
DMAnDSAH_DSA12_MASK                      equ 0010h
DMAnDSAH_DSA13_POSN                      equ 0005h
DMAnDSAH_DSA13_POSITION                  equ 0005h
DMAnDSAH_DSA13_SIZE                      equ 0001h
DMAnDSAH_DSA13_LENGTH                    equ 0001h
DMAnDSAH_DSA13_MASK                      equ 0020h
DMAnDSAH_DSA14_POSN                      equ 0006h
DMAnDSAH_DSA14_POSITION                  equ 0006h
DMAnDSAH_DSA14_SIZE                      equ 0001h
DMAnDSAH_DSA14_LENGTH                    equ 0001h
DMAnDSAH_DSA14_MASK                      equ 0040h
DMAnDSAH_DSA15_POSN                      equ 0007h
DMAnDSAH_DSA15_POSITION                  equ 0007h
DMAnDSAH_DSA15_SIZE                      equ 0001h
DMAnDSAH_DSA15_LENGTH                    equ 0001h
DMAnDSAH_DSA15_MASK                      equ 0080h

