GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: C1NBTCFGT
#define C1NBTCFGT C1NBTCFGT
C1NBTCFGT                                equ 0107h
// bitfield definitions
C1NBTCFGT_BRP_POSN                       equ 0000h
C1NBTCFGT_BRP_POSITION                   equ 0000h
C1NBTCFGT_BRP_SIZE                       equ 0008h
C1NBTCFGT_BRP_LENGTH                     equ 0008h
C1NBTCFGT_BRP_MASK                       equ 00FFh
C1NBTCFGT_BRP0_POSN                      equ 0000h
C1NBTCFGT_BRP0_POSITION                  equ 0000h
C1NBTCFGT_BRP0_SIZE                      equ 0001h
C1NBTCFGT_BRP0_LENGTH                    equ 0001h
C1NBTCFGT_BRP0_MASK                      equ 0001h
C1NBTCFGT_BRP1_POSN                      equ 0001h
C1NBTCFGT_BRP1_POSITION                  equ 0001h
C1NBTCFGT_BRP1_SIZE                      equ 0001h
C1NBTCFGT_BRP1_LENGTH                    equ 0001h
C1NBTCFGT_BRP1_MASK                      equ 0002h
C1NBTCFGT_BRP2_POSN                      equ 0002h
C1NBTCFGT_BRP2_POSITION                  equ 0002h
C1NBTCFGT_BRP2_SIZE                      equ 0001h
C1NBTCFGT_BRP2_LENGTH                    equ 0001h
C1NBTCFGT_BRP2_MASK                      equ 0004h
C1NBTCFGT_BRP3_POSN                      equ 0003h
C1NBTCFGT_BRP3_POSITION                  equ 0003h
C1NBTCFGT_BRP3_SIZE                      equ 0001h
C1NBTCFGT_BRP3_LENGTH                    equ 0001h
C1NBTCFGT_BRP3_MASK                      equ 0008h
C1NBTCFGT_BRP4_POSN                      equ 0004h
C1NBTCFGT_BRP4_POSITION                  equ 0004h
C1NBTCFGT_BRP4_SIZE                      equ 0001h
C1NBTCFGT_BRP4_LENGTH                    equ 0001h
C1NBTCFGT_BRP4_MASK                      equ 0010h
C1NBTCFGT_BRP5_POSN                      equ 0005h
C1NBTCFGT_BRP5_POSITION                  equ 0005h
C1NBTCFGT_BRP5_SIZE                      equ 0001h
C1NBTCFGT_BRP5_LENGTH                    equ 0001h
C1NBTCFGT_BRP5_MASK                      equ 0020h
C1NBTCFGT_BRP6_POSN                      equ 0006h
C1NBTCFGT_BRP6_POSITION                  equ 0006h
C1NBTCFGT_BRP6_SIZE                      equ 0001h
C1NBTCFGT_BRP6_LENGTH                    equ 0001h
C1NBTCFGT_BRP6_MASK                      equ 0040h
C1NBTCFGT_BRP7_POSN                      equ 0007h
C1NBTCFGT_BRP7_POSITION                  equ 0007h
C1NBTCFGT_BRP7_SIZE                      equ 0001h
C1NBTCFGT_BRP7_LENGTH                    equ 0001h
C1NBTCFGT_BRP7_MASK                      equ 0080h

// Register: C1DBTCFGL
#define C1DBTCFGL C1DBTCFGL
C1DBTCFGL                                equ 0108h
// bitfield definitions
C1DBTCFGL_SJW_POSN                       equ 0000h
C1DBTCFGL_SJW_POSITION                   equ 0000h
C1DBTCFGL_SJW_SIZE                       equ 0004h
C1DBTCFGL_SJW_LENGTH                     equ 0004h
C1DBTCFGL_SJW_MASK                       equ 000Fh
C1DBTCFGL_SJW0_POSN                      equ 0000h
C1DBTCFGL_SJW0_POSITION                  equ 0000h
C1DBTCFGL_SJW0_SIZE                      equ 0001h
C1DBTCFGL_SJW0_LENGTH                    equ 0001h
C1DBTCFGL_SJW0_MASK                      equ 0001h
C1DBTCFGL_SJW1_POSN                      equ 0001h
C1DBTCFGL_SJW1_POSITION                  equ 0001h
C1DBTCFGL_SJW1_SIZE                      equ 0001h
C1DBTCFGL_SJW1_LENGTH                    equ 0001h
C1DBTCFGL_SJW1_MASK                      equ 0002h
C1DBTCFGL_SJW2_POSN                      equ 0002h
C1DBTCFGL_SJW2_POSITION                  equ 0002h
C1DBTCFGL_SJW2_SIZE                      equ 0001h
C1DBTCFGL_SJW2_LENGTH                    equ 0001h
C1DBTCFGL_SJW2_MASK                      equ 0004h
C1DBTCFGL_SJW3_POSN                      equ 0003h
C1DBTCFGL_SJW3_POSITION                  equ 0003h
C1DBTCFGL_SJW3_SIZE                      equ 0001h
C1DBTCFGL_SJW3_LENGTH                    equ 0001h
C1DBTCFGL_SJW3_MASK                      equ 0008h

// Register: C1DBTCFGH
#define C1DBTCFGH C1DBTCFGH
C1DBTCFGH                                equ 0109h
// bitfield definitions
C1DBTCFGH_TSEG2_POSN                     equ 0000h
C1DBTCFGH_TSEG2_POSITION                 equ 0000h
C1DBTCFGH_TSEG2_SIZE                     equ 0004h
C1DBTCFGH_TSEG2_LENGTH                   equ 0004h
C1DBTCFGH_TSEG2_MASK                     equ 000Fh
C1DBTCFGH_TSEG20_POSN                    equ 0000h
C1DBTCFGH_TSEG20_POSITION                equ 0000h
C1DBTCFGH_TSEG20_SIZE                    equ 0001h
C1DBTCFGH_TSEG20_LENGTH                  equ 0001h
C1DBTCFGH_TSEG20_MASK                    equ 0001h
C1DBTCFGH_TSEG21_POSN                    equ 0001h
C1DBTCFGH_TSEG21_POSITION                equ 0001h
C1DBTCFGH_TSEG21_SIZE                    equ 0001h
C1DBTCFGH_TSEG21_LENGTH                  equ 0001h
C1DBTCFGH_TSEG21_MASK                    equ 0002h
C1DBTCFGH_TSEG22_POSN                    equ 0002h
C1DBTCFGH_TSEG22_POSITION                equ 0002h
C1DBTCFGH_TSEG22_SIZE                    equ 0001h
C1DBTCFGH_TSEG22_LENGTH                  equ 0001h
C1DBTCFGH_TSEG22_MASK                    equ 0004h
C1DBTCFGH_TSEG23_POSN                    equ 0003h
C1DBTCFGH_TSEG23_POSITION                equ 0003h
C1DBTCFGH_TSEG23_SIZE                    equ 0001h
C1DBTCFGH_TSEG23_LENGTH                  equ 0001h
C1DBTCFGH_TSEG23_MASK                    equ 0008h

// Register: C1DBTCFGU
#define C1DBTCFGU C1DBTCFGU
C1DBTCFGU                                equ 010Ah
// bitfield definitions
C1DBTCFGU_TSEG1_POSN                     equ 0000h
C1DBTCFGU_TSEG1_POSITION                 equ 0000h
C1DBTCFGU_TSEG1_SIZE                     equ 0005h
C1DBTCFGU_TSEG1_LENGTH                   equ 0005h
C1DBTCFGU_TSEG1_MASK                     equ 001Fh
C1DBTCFGU_TSEG10_POSN                    equ 0000h
C1DBTCFGU_TSEG10_POSITION                equ 0000h
C1DBTCFGU_TSEG10_SIZE                    equ 0001h
C1DBTCFGU_TSEG10_LENGTH                  equ 0001h
C1DBTCFGU_TSEG10_MASK                    equ 0001h
C1DBTCFGU_TSEG11_POSN                    equ 0001h
C1DBTCFGU_TSEG11_POSITION                equ 0001h
C1DBTCFGU_TSEG11_SIZE                    equ 0001h
C1DBTCFGU_TSEG11_LENGTH                  equ 0001h
C1DBTCFGU_TSEG11_MASK                    equ 0002h
C1DBTCFGU_TSEG12_POSN                    equ 0002h
C1DBTCFGU_TSEG12_POSITION                equ 0002h
C1DBTCFGU_TSEG12_SIZE                    equ 0001h
C1DBTCFGU_TSEG12_LENGTH                  equ 0001h
C1DBTCFGU_TSEG12_MASK                    equ 0004h
C1DBTCFGU_TSEG13_POSN                    equ 0003h
C1DBTCFGU_TSEG13_POSITION                equ 0003h
C1DBTCFGU_TSEG13_SIZE                    equ 0001h
C1DBTCFGU_TSEG13_LENGTH                  equ 0001h
C1DBTCFGU_TSEG13_MASK                    equ 0008h
C1DBTCFGU_TSEG14_POSN                    equ 0004h
C1DBTCFGU_TSEG14_POSITION                equ 0004h
C1DBTCFGU_TSEG14_SIZE                    equ 0001h
C1DBTCFGU_TSEG14_LENGTH                  equ 0001h
C1DBTCFGU_TSEG14_MASK                    equ 0010h

// Register: C1DBTCFGT
#define C1DBTCFGT C1DBTCFGT
C1DBTCFGT                                equ 010Bh
// bitfield definitions
C1DBTCFGT_BRP_POSN                       equ 0000h
C1DBTCFGT_BRP_POSITION                   equ 0000h
C1DBTCFGT_BRP_SIZE                       equ 0008h
C1DBTCFGT_BRP_LENGTH                     equ 0008h
C1DBTCFGT_BRP_MASK                       equ 00FFh
C1DBTCFGT_BRP0_POSN                      equ 0000h
C1DBTCFGT_BRP0_POSITION                  equ 0000h
C1DBTCFGT_BRP0_SIZE                      equ 0001h
C1DBTCFGT_BRP0_LENGTH                    equ 0001h
C1DBTCFGT_BRP0_MASK                      equ 0001h
C1DBTCFGT_BRP1_POSN                      equ 0001h
C1DBTCFGT_BRP1_POSITION                  equ 0001h
C1DBTCFGT_BRP1_SIZE                      equ 0001h
C1DBTCFGT_BRP1_LENGTH                    equ 0001h
C1DBTCFGT_BRP1_MASK                      equ 0002h
C1DBTCFGT_BRP2_POSN                      equ 0002h
C1DBTCFGT_BRP2_POSITION                  equ 0002h
C1DBTCFGT_BRP2_SIZE                      equ 0001h
C1DBTCFGT_BRP2_LENGTH                    equ 0001h
C1DBTCFGT_BRP2_MASK                      equ 0004h
C1DBTCFGT_BRP3_POSN                      equ 0003h
C1DBTCFGT_BRP3_POSITION                  equ 0003h
C1DBTCFGT_BRP3_SIZE                      equ 0001h
C1DBTCFGT_BRP3_LENGTH                    equ 0001h
C1DBTCFGT_BRP3_MASK                      equ 0008h
C1DBTCFGT_BRP4_POSN                      equ 0004h
C1DBTCFGT_BRP4_POSITION                  equ 0004h
C1DBTCFGT_BRP4_SIZE                      equ 0001h
C1DBTCFGT_BRP4_LENGTH                    equ 0001h
C1DBTCFGT_BRP4_MASK                      equ 0010h
C1DBTCFGT_BRP5_POSN                      equ 0005h
C1DBTCFGT_BRP5_POSITION                  equ 0005h
C1DBTCFGT_BRP5_SIZE                      equ 0001h
C1DBTCFGT_BRP5_LENGTH                    equ 0001h
C1DBTCFGT_BRP5_MASK                      equ 0020h
C1DBTCFGT_BRP6_POSN                      equ 0006h
C1DBTCFGT_BRP6_POSITION                  equ 0006h
C1DBTCFGT_BRP6_SIZE                      equ 0001h
C1DBTCFGT_BRP6_LENGTH                    equ 0001h
C1DBTCFGT_BRP6_MASK                      equ 0040h
C1DBTCFGT_BRP7_POSN                      equ 0007h
C1DBTCFGT_BRP7_POSITION                  equ 0007h
C1DBTCFGT_BRP7_SIZE                      equ 0001h
C1DBTCFGT_BRP7_LENGTH                    equ 0001h
C1DBTCFGT_BRP7_MASK                      equ 0080h

