GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: C1TDCL
#define C1TDCL C1TDCL
C1TDCL                                   equ 010Ch
// bitfield definitions
C1TDCL_TDCV_POSN                         equ 0000h
C1TDCL_TDCV_POSITION                     equ 0000h
C1TDCL_TDCV_SIZE                         equ 0006h
C1TDCL_TDCV_LENGTH                       equ 0006h
C1TDCL_TDCV_MASK                         equ 003Fh
C1TDCL_TDCV0_POSN                        equ 0000h
C1TDCL_TDCV0_POSITION                    equ 0000h
C1TDCL_TDCV0_SIZE                        equ 0001h
C1TDCL_TDCV0_LENGTH                      equ 0001h
C1TDCL_TDCV0_MASK                        equ 0001h
C1TDCL_TDCV1_POSN                        equ 0001h
C1TDCL_TDCV1_POSITION                    equ 0001h
C1TDCL_TDCV1_SIZE                        equ 0001h
C1TDCL_TDCV1_LENGTH                      equ 0001h
C1TDCL_TDCV1_MASK                        equ 0002h
C1TDCL_TDCV2_POSN                        equ 0002h
C1TDCL_TDCV2_POSITION                    equ 0002h
C1TDCL_TDCV2_SIZE                        equ 0001h
C1TDCL_TDCV2_LENGTH                      equ 0001h
C1TDCL_TDCV2_MASK                        equ 0004h
C1TDCL_TDCV3_POSN                        equ 0003h
C1TDCL_TDCV3_POSITION                    equ 0003h
C1TDCL_TDCV3_SIZE                        equ 0001h
C1TDCL_TDCV3_LENGTH                      equ 0001h
C1TDCL_TDCV3_MASK                        equ 0008h
C1TDCL_TDCV4_POSN                        equ 0004h
C1TDCL_TDCV4_POSITION                    equ 0004h
C1TDCL_TDCV4_SIZE                        equ 0001h
C1TDCL_TDCV4_LENGTH                      equ 0001h
C1TDCL_TDCV4_MASK                        equ 0010h
C1TDCL_TDCV5_POSN                        equ 0005h
C1TDCL_TDCV5_POSITION                    equ 0005h
C1TDCL_TDCV5_SIZE                        equ 0001h
C1TDCL_TDCV5_LENGTH                      equ 0001h
C1TDCL_TDCV5_MASK                        equ 0020h

// Register: C1TDCH
#define C1TDCH C1TDCH
C1TDCH                                   equ 010Dh
// bitfield definitions
C1TDCH_TDCO_POSN                         equ 0000h
C1TDCH_TDCO_POSITION                     equ 0000h
C1TDCH_TDCO_SIZE                         equ 0007h
C1TDCH_TDCO_LENGTH                       equ 0007h
C1TDCH_TDCO_MASK                         equ 007Fh
C1TDCH_TDCO0_POSN                        equ 0000h
C1TDCH_TDCO0_POSITION                    equ 0000h
C1TDCH_TDCO0_SIZE                        equ 0001h
C1TDCH_TDCO0_LENGTH                      equ 0001h
C1TDCH_TDCO0_MASK                        equ 0001h
C1TDCH_TDCO1_POSN                        equ 0001h
C1TDCH_TDCO1_POSITION                    equ 0001h
C1TDCH_TDCO1_SIZE                        equ 0001h
C1TDCH_TDCO1_LENGTH                      equ 0001h
C1TDCH_TDCO1_MASK                        equ 0002h
C1TDCH_TDCO2_POSN                        equ 0002h
C1TDCH_TDCO2_POSITION                    equ 0002h
C1TDCH_TDCO2_SIZE                        equ 0001h
C1TDCH_TDCO2_LENGTH                      equ 0001h
C1TDCH_TDCO2_MASK                        equ 0004h
C1TDCH_TDCO3_POSN                        equ 0003h
C1TDCH_TDCO3_POSITION                    equ 0003h
C1TDCH_TDCO3_SIZE                        equ 0001h
C1TDCH_TDCO3_LENGTH                      equ 0001h
C1TDCH_TDCO3_MASK                        equ 0008h
C1TDCH_TDCO4_POSN                        equ 0004h
C1TDCH_TDCO4_POSITION                    equ 0004h
C1TDCH_TDCO4_SIZE                        equ 0001h
C1TDCH_TDCO4_LENGTH                      equ 0001h
C1TDCH_TDCO4_MASK                        equ 0010h
C1TDCH_TDCO5_POSN                        equ 0005h
C1TDCH_TDCO5_POSITION                    equ 0005h
C1TDCH_TDCO5_SIZE                        equ 0001h
C1TDCH_TDCO5_LENGTH                      equ 0001h
C1TDCH_TDCO5_MASK                        equ 0020h
C1TDCH_TDCO6_POSN                        equ 0006h
C1TDCH_TDCO6_POSITION                    equ 0006h
C1TDCH_TDCO6_SIZE                        equ 0001h
C1TDCH_TDCO6_LENGTH                      equ 0001h
C1TDCH_TDCO6_MASK                        equ 0040h

// Register: C1TDCU
#define C1TDCU C1TDCU
C1TDCU                                   equ 010Eh
// bitfield definitions
C1TDCU_TDCMOD_POSN                       equ 0000h
C1TDCU_TDCMOD_POSITION                   equ 0000h
C1TDCU_TDCMOD_SIZE                       equ 0002h
C1TDCU_TDCMOD_LENGTH                     equ 0002h
C1TDCU_TDCMOD_MASK                       equ 0003h
C1TDCU_TDCMOD0_POSN                      equ 0000h
C1TDCU_TDCMOD0_POSITION                  equ 0000h
C1TDCU_TDCMOD0_SIZE                      equ 0001h
C1TDCU_TDCMOD0_LENGTH                    equ 0001h
C1TDCU_TDCMOD0_MASK                      equ 0001h
C1TDCU_TDCMOD1_POSN                      equ 0001h
C1TDCU_TDCMOD1_POSITION                  equ 0001h
C1TDCU_TDCMOD1_SIZE                      equ 0001h
C1TDCU_TDCMOD1_LENGTH                    equ 0001h
C1TDCU_TDCMOD1_MASK                      equ 0002h

// Register: C1TBC
#define C1TBC C1TBC
C1TBC                                    equ 0110h

// Register: C1TBCL
#define C1TBCL C1TBCL
C1TBCL                                   equ 0110h
// bitfield definitions
C1TBCL_TBC_POSN                          equ 0000h
C1TBCL_TBC_POSITION                      equ 0000h
C1TBCL_TBC_SIZE                          equ 0008h
C1TBCL_TBC_LENGTH                        equ 0008h
C1TBCL_TBC_MASK                          equ 00FFh
C1TBCL_TBC0_POSN                         equ 0000h
C1TBCL_TBC0_POSITION                     equ 0000h
C1TBCL_TBC0_SIZE                         equ 0001h
C1TBCL_TBC0_LENGTH                       equ 0001h
C1TBCL_TBC0_MASK                         equ 0001h
C1TBCL_TBC1_POSN                         equ 0001h
C1TBCL_TBC1_POSITION                     equ 0001h
C1TBCL_TBC1_SIZE                         equ 0001h
C1TBCL_TBC1_LENGTH                       equ 0001h
C1TBCL_TBC1_MASK                         equ 0002h
C1TBCL_TBC2_POSN                         equ 0002h
C1TBCL_TBC2_POSITION                     equ 0002h
C1TBCL_TBC2_SIZE                         equ 0001h
C1TBCL_TBC2_LENGTH                       equ 0001h
C1TBCL_TBC2_MASK                         equ 0004h
C1TBCL_TBC3_POSN                         equ 0003h
C1TBCL_TBC3_POSITION                     equ 0003h
C1TBCL_TBC3_SIZE                         equ 0001h
C1TBCL_TBC3_LENGTH                       equ 0001h
C1TBCL_TBC3_MASK                         equ 0008h
C1TBCL_TBC4_POSN                         equ 0004h
C1TBCL_TBC4_POSITION                     equ 0004h
C1TBCL_TBC4_SIZE                         equ 0001h
C1TBCL_TBC4_LENGTH                       equ 0001h
C1TBCL_TBC4_MASK                         equ 0010h
C1TBCL_TBC5_POSN                         equ 0005h
C1TBCL_TBC5_POSITION                     equ 0005h
C1TBCL_TBC5_SIZE                         equ 0001h
C1TBCL_TBC5_LENGTH                       equ 0001h
C1TBCL_TBC5_MASK                         equ 0020h
C1TBCL_TBC6_POSN                         equ 0006h
C1TBCL_TBC6_POSITION                     equ 0006h
C1TBCL_TBC6_SIZE                         equ 0001h
C1TBCL_TBC6_LENGTH                       equ 0001h
C1TBCL_TBC6_MASK                         equ 0040h
C1TBCL_TBC7_POSN                         equ 0007h
C1TBCL_TBC7_POSITION                     equ 0007h
C1TBCL_TBC7_SIZE                         equ 0001h
C1TBCL_TBC7_LENGTH                       equ 0001h
C1TBCL_TBC7_MASK                         equ 0080h

// Register: C1TBCH
#define C1TBCH C1TBCH
C1TBCH                                   equ 0111h
// bitfield definitions
C1TBCH_TBC_POSN                          equ 0000h
C1TBCH_TBC_POSITION                      equ 0000h
C1TBCH_TBC_SIZE                          equ 0008h
C1TBCH_TBC_LENGTH                        equ 0008h
C1TBCH_TBC_MASK                          equ 00FFh
C1TBCH_TBC8_POSN                         equ 0000h
C1TBCH_TBC8_POSITION                     equ 0000h
C1TBCH_TBC8_SIZE                         equ 0001h
C1TBCH_TBC8_LENGTH                       equ 0001h
C1TBCH_TBC8_MASK                         equ 0001h
C1TBCH_TBC9_POSN                         equ 0001h
C1TBCH_TBC9_POSITION                     equ 0001h
C1TBCH_TBC9_SIZE                         equ 0001h
C1TBCH_TBC9_LENGTH                       equ 0001h
C1TBCH_TBC9_MASK                         equ 0002h
C1TBCH_TBC10_POSN                        equ 0002h
C1TBCH_TBC10_POSITION                    equ 0002h
C1TBCH_TBC10_SIZE                        equ 0001h
C1TBCH_TBC10_LENGTH                      equ 0001h
C1TBCH_TBC10_MASK                        equ 0004h
C1TBCH_TBC11_POSN                        equ 0003h
C1TBCH_TBC11_POSITION                    equ 0003h
C1TBCH_TBC11_SIZE                        equ 0001h
C1TBCH_TBC11_LENGTH                      equ 0001h
C1TBCH_TBC11_MASK                        equ 0008h
C1TBCH_TBC12_POSN                        equ 0004h
C1TBCH_TBC12_POSITION                    equ 0004h
C1TBCH_TBC12_SIZE                        equ 0001h
C1TBCH_TBC12_LENGTH                      equ 0001h
C1TBCH_TBC12_MASK                        equ 0010h
C1TBCH_TBC13_POSN                        equ 0005h
C1TBCH_TBC13_POSITION                    equ 0005h
C1TBCH_TBC13_SIZE                        equ 0001h
C1TBCH_TBC13_LENGTH                      equ 0001h
C1TBCH_TBC13_MASK                        equ 0020h
C1TBCH_TBC14_POSN                        equ 0006h
C1TBCH_TBC14_POSITION                    equ 0006h
C1TBCH_TBC14_SIZE                        equ 0001h
C1TBCH_TBC14_LENGTH                      equ 0001h
C1TBCH_TBC14_MASK                        equ 0040h
C1TBCH_TBC15_POSN                        equ 0007h
C1TBCH_TBC15_POSITION                    equ 0007h
C1TBCH_TBC15_SIZE                        equ 0001h
C1TBCH_TBC15_LENGTH                      equ 0001h
C1TBCH_TBC15_MASK                        equ 0080h

// Register: C1TBCU
#define C1TBCU C1TBCU
C1TBCU                                   equ 0112h
// bitfield definitions
C1TBCU_TBC_POSN                          equ 0000h
C1TBCU_TBC_POSITION                      equ 0000h
C1TBCU_TBC_SIZE                          equ 0008h
C1TBCU_TBC_LENGTH                        equ 0008h
C1TBCU_TBC_MASK                          equ 00FFh
C1TBCU_TBC16_POSN                        equ 0000h
C1TBCU_TBC16_POSITION                    equ 0000h
C1TBCU_TBC16_SIZE                        equ 0001h
C1TBCU_TBC16_LENGTH                      equ 0001h
C1TBCU_TBC16_MASK                        equ 0001h
C1TBCU_TBC17_POSN                        equ 0001h
C1TBCU_TBC17_POSITION                    equ 0001h
C1TBCU_TBC17_SIZE                        equ 0001h
C1TBCU_TBC17_LENGTH                      equ 0001h
C1TBCU_TBC17_MASK                        equ 0002h
C1TBCU_TBC18_POSN                        equ 0002h
C1TBCU_TBC18_POSITION                    equ 0002h
C1TBCU_TBC18_SIZE                        equ 0001h
C1TBCU_TBC18_LENGTH                      equ 0001h
C1TBCU_TBC18_MASK                        equ 0004h
C1TBCU_TBC19_POSN                        equ 0003h
C1TBCU_TBC19_POSITION                    equ 0003h
C1TBCU_TBC19_SIZE                        equ 0001h
C1TBCU_TBC19_LENGTH                      equ 0001h
C1TBCU_TBC19_MASK                        equ 0008h
C1TBCU_TBC20_POSN                        equ 0004h
C1TBCU_TBC20_POSITION                    equ 0004h
C1TBCU_TBC20_SIZE                        equ 0001h
C1TBCU_TBC20_LENGTH                      equ 0001h
C1TBCU_TBC20_MASK                        equ 0010h
C1TBCU_TBC21_POSN                        equ 0005h
C1TBCU_TBC21_POSITION                    equ 0005h
C1TBCU_TBC21_SIZE                        equ 0001h
C1TBCU_TBC21_LENGTH                      equ 0001h
C1TBCU_TBC21_MASK                        equ 0020h
C1TBCU_TBC22_POSN                        equ 0006h
C1TBCU_TBC22_POSITION                    equ 0006h
C1TBCU_TBC22_SIZE                        equ 0001h
C1TBCU_TBC22_LENGTH                      equ 0001h
C1TBCU_TBC22_MASK                        equ 0040h
C1TBCU_TBC23_POSN                        equ 0007h
C1TBCU_TBC23_POSITION                    equ 0007h
C1TBCU_TBC23_SIZE                        equ 0001h
C1TBCU_TBC23_LENGTH                      equ 0001h
C1TBCU_TBC23_MASK                        equ 0080h

