GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: C1TXIF
#define C1TXIF C1TXIF
C1TXIF                                   equ 0124h

// Register: C1TXIFL
#define C1TXIFL C1TXIFL
C1TXIFL                                  equ 0124h
// bitfield definitions
C1TXIFL_TFIF_POSN                        equ 0000h
C1TXIFL_TFIF_POSITION                    equ 0000h
C1TXIFL_TFIF_SIZE                        equ 0008h
C1TXIFL_TFIF_LENGTH                      equ 0008h
C1TXIFL_TFIF_MASK                        equ 00FFh
C1TXIFL_TFIF0_POSN                       equ 0000h
C1TXIFL_TFIF0_POSITION                   equ 0000h
C1TXIFL_TFIF0_SIZE                       equ 0001h
C1TXIFL_TFIF0_LENGTH                     equ 0001h
C1TXIFL_TFIF0_MASK                       equ 0001h
C1TXIFL_TFIF1_POSN                       equ 0001h
C1TXIFL_TFIF1_POSITION                   equ 0001h
C1TXIFL_TFIF1_SIZE                       equ 0001h
C1TXIFL_TFIF1_LENGTH                     equ 0001h
C1TXIFL_TFIF1_MASK                       equ 0002h
C1TXIFL_TFIF2_POSN                       equ 0002h
C1TXIFL_TFIF2_POSITION                   equ 0002h
C1TXIFL_TFIF2_SIZE                       equ 0001h
C1TXIFL_TFIF2_LENGTH                     equ 0001h
C1TXIFL_TFIF2_MASK                       equ 0004h
C1TXIFL_TFIF3_POSN                       equ 0003h
C1TXIFL_TFIF3_POSITION                   equ 0003h
C1TXIFL_TFIF3_SIZE                       equ 0001h
C1TXIFL_TFIF3_LENGTH                     equ 0001h
C1TXIFL_TFIF3_MASK                       equ 0008h
C1TXIFL_TFIF4_POSN                       equ 0004h
C1TXIFL_TFIF4_POSITION                   equ 0004h
C1TXIFL_TFIF4_SIZE                       equ 0001h
C1TXIFL_TFIF4_LENGTH                     equ 0001h
C1TXIFL_TFIF4_MASK                       equ 0010h
C1TXIFL_TFIF5_POSN                       equ 0005h
C1TXIFL_TFIF5_POSITION                   equ 0005h
C1TXIFL_TFIF5_SIZE                       equ 0001h
C1TXIFL_TFIF5_LENGTH                     equ 0001h
C1TXIFL_TFIF5_MASK                       equ 0020h
C1TXIFL_TFIF6_POSN                       equ 0006h
C1TXIFL_TFIF6_POSITION                   equ 0006h
C1TXIFL_TFIF6_SIZE                       equ 0001h
C1TXIFL_TFIF6_LENGTH                     equ 0001h
C1TXIFL_TFIF6_MASK                       equ 0040h
C1TXIFL_TFIF7_POSN                       equ 0007h
C1TXIFL_TFIF7_POSITION                   equ 0007h
C1TXIFL_TFIF7_SIZE                       equ 0001h
C1TXIFL_TFIF7_LENGTH                     equ 0001h
C1TXIFL_TFIF7_MASK                       equ 0080h

// Register: C1TXIFH
#define C1TXIFH C1TXIFH
C1TXIFH                                  equ 0125h
// bitfield definitions
C1TXIFH_TFIF_POSN                        equ 0000h
C1TXIFH_TFIF_POSITION                    equ 0000h
C1TXIFH_TFIF_SIZE                        equ 0008h
C1TXIFH_TFIF_LENGTH                      equ 0008h
C1TXIFH_TFIF_MASK                        equ 00FFh
C1TXIFH_TFIF8_POSN                       equ 0000h
C1TXIFH_TFIF8_POSITION                   equ 0000h
C1TXIFH_TFIF8_SIZE                       equ 0001h
C1TXIFH_TFIF8_LENGTH                     equ 0001h
C1TXIFH_TFIF8_MASK                       equ 0001h
C1TXIFH_TFIF9_POSN                       equ 0001h
C1TXIFH_TFIF9_POSITION                   equ 0001h
C1TXIFH_TFIF9_SIZE                       equ 0001h
C1TXIFH_TFIF9_LENGTH                     equ 0001h
C1TXIFH_TFIF9_MASK                       equ 0002h
C1TXIFH_TFIF10_POSN                      equ 0002h
C1TXIFH_TFIF10_POSITION                  equ 0002h
C1TXIFH_TFIF10_SIZE                      equ 0001h
C1TXIFH_TFIF10_LENGTH                    equ 0001h
C1TXIFH_TFIF10_MASK                      equ 0004h
C1TXIFH_TFIF11_POSN                      equ 0003h
C1TXIFH_TFIF11_POSITION                  equ 0003h
C1TXIFH_TFIF11_SIZE                      equ 0001h
C1TXIFH_TFIF11_LENGTH                    equ 0001h
C1TXIFH_TFIF11_MASK                      equ 0008h
C1TXIFH_TFIF12_POSN                      equ 0004h
C1TXIFH_TFIF12_POSITION                  equ 0004h
C1TXIFH_TFIF12_SIZE                      equ 0001h
C1TXIFH_TFIF12_LENGTH                    equ 0001h
C1TXIFH_TFIF12_MASK                      equ 0010h
C1TXIFH_TFIF13_POSN                      equ 0005h
C1TXIFH_TFIF13_POSITION                  equ 0005h
C1TXIFH_TFIF13_SIZE                      equ 0001h
C1TXIFH_TFIF13_LENGTH                    equ 0001h
C1TXIFH_TFIF13_MASK                      equ 0020h
C1TXIFH_TFIF14_POSN                      equ 0006h
C1TXIFH_TFIF14_POSITION                  equ 0006h
C1TXIFH_TFIF14_SIZE                      equ 0001h
C1TXIFH_TFIF14_LENGTH                    equ 0001h
C1TXIFH_TFIF14_MASK                      equ 0040h
C1TXIFH_TFIF15_POSN                      equ 0007h
C1TXIFH_TFIF15_POSITION                  equ 0007h
C1TXIFH_TFIF15_SIZE                      equ 0001h
C1TXIFH_TFIF15_LENGTH                    equ 0001h
C1TXIFH_TFIF15_MASK                      equ 0080h

// Register: C1TXIFU
#define C1TXIFU C1TXIFU
C1TXIFU                                  equ 0126h
// bitfield definitions
C1TXIFU_TFIF_POSN                        equ 0000h
C1TXIFU_TFIF_POSITION                    equ 0000h
C1TXIFU_TFIF_SIZE                        equ 0008h
C1TXIFU_TFIF_LENGTH                      equ 0008h
C1TXIFU_TFIF_MASK                        equ 00FFh
C1TXIFU_TFIF16_POSN                      equ 0000h
C1TXIFU_TFIF16_POSITION                  equ 0000h
C1TXIFU_TFIF16_SIZE                      equ 0001h
C1TXIFU_TFIF16_LENGTH                    equ 0001h
C1TXIFU_TFIF16_MASK                      equ 0001h
C1TXIFU_TFIF17_POSN                      equ 0001h
C1TXIFU_TFIF17_POSITION                  equ 0001h
C1TXIFU_TFIF17_SIZE                      equ 0001h
C1TXIFU_TFIF17_LENGTH                    equ 0001h
C1TXIFU_TFIF17_MASK                      equ 0002h
C1TXIFU_TFIF18_POSN                      equ 0002h
C1TXIFU_TFIF18_POSITION                  equ 0002h
C1TXIFU_TFIF18_SIZE                      equ 0001h
C1TXIFU_TFIF18_LENGTH                    equ 0001h
C1TXIFU_TFIF18_MASK                      equ 0004h
C1TXIFU_TFIF19_POSN                      equ 0003h
C1TXIFU_TFIF19_POSITION                  equ 0003h
C1TXIFU_TFIF19_SIZE                      equ 0001h
C1TXIFU_TFIF19_LENGTH                    equ 0001h
C1TXIFU_TFIF19_MASK                      equ 0008h
C1TXIFU_TFIF20_POSN                      equ 0004h
C1TXIFU_TFIF20_POSITION                  equ 0004h
C1TXIFU_TFIF20_SIZE                      equ 0001h
C1TXIFU_TFIF20_LENGTH                    equ 0001h
C1TXIFU_TFIF20_MASK                      equ 0010h
C1TXIFU_TFIF21_POSN                      equ 0005h
C1TXIFU_TFIF21_POSITION                  equ 0005h
C1TXIFU_TFIF21_SIZE                      equ 0001h
C1TXIFU_TFIF21_LENGTH                    equ 0001h
C1TXIFU_TFIF21_MASK                      equ 0020h
C1TXIFU_TFIF22_POSN                      equ 0006h
C1TXIFU_TFIF22_POSITION                  equ 0006h
C1TXIFU_TFIF22_SIZE                      equ 0001h
C1TXIFU_TFIF22_LENGTH                    equ 0001h
C1TXIFU_TFIF22_MASK                      equ 0040h
C1TXIFU_TFIF23_POSN                      equ 0007h
C1TXIFU_TFIF23_POSITION                  equ 0007h
C1TXIFU_TFIF23_SIZE                      equ 0001h
C1TXIFU_TFIF23_LENGTH                    equ 0001h
C1TXIFU_TFIF23_MASK                      equ 0080h

// Register: C1TXIFT
#define C1TXIFT C1TXIFT
C1TXIFT                                  equ 0127h
// bitfield definitions
C1TXIFT_TFIF_POSN                        equ 0000h
C1TXIFT_TFIF_POSITION                    equ 0000h
C1TXIFT_TFIF_SIZE                        equ 0008h
C1TXIFT_TFIF_LENGTH                      equ 0008h
C1TXIFT_TFIF_MASK                        equ 00FFh
C1TXIFT_TFIF24_POSN                      equ 0000h
C1TXIFT_TFIF24_POSITION                  equ 0000h
C1TXIFT_TFIF24_SIZE                      equ 0001h
C1TXIFT_TFIF24_LENGTH                    equ 0001h
C1TXIFT_TFIF24_MASK                      equ 0001h
C1TXIFT_TFIF25_POSN                      equ 0001h
C1TXIFT_TFIF25_POSITION                  equ 0001h
C1TXIFT_TFIF25_SIZE                      equ 0001h
C1TXIFT_TFIF25_LENGTH                    equ 0001h
C1TXIFT_TFIF25_MASK                      equ 0002h
C1TXIFT_TFIF26_POSN                      equ 0002h
C1TXIFT_TFIF26_POSITION                  equ 0002h
C1TXIFT_TFIF26_SIZE                      equ 0001h
C1TXIFT_TFIF26_LENGTH                    equ 0001h
C1TXIFT_TFIF26_MASK                      equ 0004h
C1TXIFT_TFIF27_POSN                      equ 0003h
C1TXIFT_TFIF27_POSITION                  equ 0003h
C1TXIFT_TFIF27_SIZE                      equ 0001h
C1TXIFT_TFIF27_LENGTH                    equ 0001h
C1TXIFT_TFIF27_MASK                      equ 0008h
C1TXIFT_TFIF28_POSN                      equ 0004h
C1TXIFT_TFIF28_POSITION                  equ 0004h
C1TXIFT_TFIF28_SIZE                      equ 0001h
C1TXIFT_TFIF28_LENGTH                    equ 0001h
C1TXIFT_TFIF28_MASK                      equ 0010h
C1TXIFT_TFIF29_POSN                      equ 0005h
C1TXIFT_TFIF29_POSITION                  equ 0005h
C1TXIFT_TFIF29_SIZE                      equ 0001h
C1TXIFT_TFIF29_LENGTH                    equ 0001h
C1TXIFT_TFIF29_MASK                      equ 0020h
C1TXIFT_TFIF30_POSN                      equ 0006h
C1TXIFT_TFIF30_POSITION                  equ 0006h
C1TXIFT_TFIF30_SIZE                      equ 0001h
C1TXIFT_TFIF30_LENGTH                    equ 0001h
C1TXIFT_TFIF30_MASK                      equ 0040h
C1TXIFT_TFIF31_POSN                      equ 0007h
C1TXIFT_TFIF31_POSITION                  equ 0007h
C1TXIFT_TFIF31_SIZE                      equ 0001h
C1TXIFT_TFIF31_LENGTH                    equ 0001h
C1TXIFT_TFIF31_MASK                      equ 0080h

// Register: C1RXOVIF
#define C1RXOVIF C1RXOVIF
C1RXOVIF                                 equ 0128h

// Register: C1RXOVIFL
#define C1RXOVIFL C1RXOVIFL
C1RXOVIFL                                equ 0128h
// bitfield definitions
C1RXOVIFL_RFOVIF_POSN                    equ 0001h
C1RXOVIFL_RFOVIF_POSITION                equ 0001h
C1RXOVIFL_RFOVIF_SIZE                    equ 0007h
C1RXOVIFL_RFOVIF_LENGTH                  equ 0007h
C1RXOVIFL_RFOVIF_MASK                    equ 00FEh
C1RXOVIFL_RFOVIF1_POSN                   equ 0001h
C1RXOVIFL_RFOVIF1_POSITION               equ 0001h
C1RXOVIFL_RFOVIF1_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF1_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF1_MASK                   equ 0002h
C1RXOVIFL_RFOVIF2_POSN                   equ 0002h
C1RXOVIFL_RFOVIF2_POSITION               equ 0002h
C1RXOVIFL_RFOVIF2_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF2_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF2_MASK                   equ 0004h
C1RXOVIFL_RFOVIF3_POSN                   equ 0003h
C1RXOVIFL_RFOVIF3_POSITION               equ 0003h
C1RXOVIFL_RFOVIF3_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF3_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF3_MASK                   equ 0008h
C1RXOVIFL_RFOVIF4_POSN                   equ 0004h
C1RXOVIFL_RFOVIF4_POSITION               equ 0004h
C1RXOVIFL_RFOVIF4_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF4_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF4_MASK                   equ 0010h
C1RXOVIFL_RFOVIF5_POSN                   equ 0005h
C1RXOVIFL_RFOVIF5_POSITION               equ 0005h
C1RXOVIFL_RFOVIF5_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF5_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF5_MASK                   equ 0020h
C1RXOVIFL_RFOVIF6_POSN                   equ 0006h
C1RXOVIFL_RFOVIF6_POSITION               equ 0006h
C1RXOVIFL_RFOVIF6_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF6_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF6_MASK                   equ 0040h
C1RXOVIFL_RFOVIF7_POSN                   equ 0007h
C1RXOVIFL_RFOVIF7_POSITION               equ 0007h
C1RXOVIFL_RFOVIF7_SIZE                   equ 0001h
C1RXOVIFL_RFOVIF7_LENGTH                 equ 0001h
C1RXOVIFL_RFOVIF7_MASK                   equ 0080h

// Register: C1RXOVIFH
#define C1RXOVIFH C1RXOVIFH
C1RXOVIFH                                equ 0129h
// bitfield definitions
C1RXOVIFH_RFOVIF_POSN                    equ 0000h
C1RXOVIFH_RFOVIF_POSITION                equ 0000h
C1RXOVIFH_RFOVIF_SIZE                    equ 0008h
C1RXOVIFH_RFOVIF_LENGTH                  equ 0008h
C1RXOVIFH_RFOVIF_MASK                    equ 00FFh
C1RXOVIFH_RFOVIF8_POSN                   equ 0000h
C1RXOVIFH_RFOVIF8_POSITION               equ 0000h
C1RXOVIFH_RFOVIF8_SIZE                   equ 0001h
C1RXOVIFH_RFOVIF8_LENGTH                 equ 0001h
C1RXOVIFH_RFOVIF8_MASK                   equ 0001h
C1RXOVIFH_RFOVIF9_POSN                   equ 0001h
C1RXOVIFH_RFOVIF9_POSITION               equ 0001h
C1RXOVIFH_RFOVIF9_SIZE                   equ 0001h
C1RXOVIFH_RFOVIF9_LENGTH                 equ 0001h
C1RXOVIFH_RFOVIF9_MASK                   equ 0002h
C1RXOVIFH_RFOVIF10_POSN                  equ 0002h
C1RXOVIFH_RFOVIF10_POSITION              equ 0002h
C1RXOVIFH_RFOVIF10_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF10_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF10_MASK                  equ 0004h
C1RXOVIFH_RFOVIF11_POSN                  equ 0003h
C1RXOVIFH_RFOVIF11_POSITION              equ 0003h
C1RXOVIFH_RFOVIF11_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF11_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF11_MASK                  equ 0008h
C1RXOVIFH_RFOVIF12_POSN                  equ 0004h
C1RXOVIFH_RFOVIF12_POSITION              equ 0004h
C1RXOVIFH_RFOVIF12_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF12_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF12_MASK                  equ 0010h
C1RXOVIFH_RFOVIF13_POSN                  equ 0005h
C1RXOVIFH_RFOVIF13_POSITION              equ 0005h
C1RXOVIFH_RFOVIF13_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF13_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF13_MASK                  equ 0020h
C1RXOVIFH_RFOVIF14_POSN                  equ 0006h
C1RXOVIFH_RFOVIF14_POSITION              equ 0006h
C1RXOVIFH_RFOVIF14_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF14_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF14_MASK                  equ 0040h
C1RXOVIFH_RFOVIF15_POSN                  equ 0007h
C1RXOVIFH_RFOVIF15_POSITION              equ 0007h
C1RXOVIFH_RFOVIF15_SIZE                  equ 0001h
C1RXOVIFH_RFOVIF15_LENGTH                equ 0001h
C1RXOVIFH_RFOVIF15_MASK                  equ 0080h

// Register: C1RXOVIFU
#define C1RXOVIFU C1RXOVIFU
C1RXOVIFU                                equ 012Ah
// bitfield definitions
C1RXOVIFU_RFOVIF_POSN                    equ 0000h
C1RXOVIFU_RFOVIF_POSITION                equ 0000h
C1RXOVIFU_RFOVIF_SIZE                    equ 0008h
C1RXOVIFU_RFOVIF_LENGTH                  equ 0008h
C1RXOVIFU_RFOVIF_MASK                    equ 00FFh
C1RXOVIFU_RFOVIF16_POSN                  equ 0000h
C1RXOVIFU_RFOVIF16_POSITION              equ 0000h
C1RXOVIFU_RFOVIF16_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF16_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF16_MASK                  equ 0001h
C1RXOVIFU_RFOVIF17_POSN                  equ 0001h
C1RXOVIFU_RFOVIF17_POSITION              equ 0001h
C1RXOVIFU_RFOVIF17_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF17_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF17_MASK                  equ 0002h
C1RXOVIFU_RFOVIF18_POSN                  equ 0002h
C1RXOVIFU_RFOVIF18_POSITION              equ 0002h
C1RXOVIFU_RFOVIF18_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF18_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF18_MASK                  equ 0004h
C1RXOVIFU_RFOVIF19_POSN                  equ 0003h
C1RXOVIFU_RFOVIF19_POSITION              equ 0003h
C1RXOVIFU_RFOVIF19_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF19_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF19_MASK                  equ 0008h
C1RXOVIFU_RFOVIF20_POSN                  equ 0004h
C1RXOVIFU_RFOVIF20_POSITION              equ 0004h
C1RXOVIFU_RFOVIF20_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF20_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF20_MASK                  equ 0010h
C1RXOVIFU_RFOVIF21_POSN                  equ 0005h
C1RXOVIFU_RFOVIF21_POSITION              equ 0005h
C1RXOVIFU_RFOVIF21_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF21_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF21_MASK                  equ 0020h
C1RXOVIFU_RFOVIF22_POSN                  equ 0006h
C1RXOVIFU_RFOVIF22_POSITION              equ 0006h
C1RXOVIFU_RFOVIF22_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF22_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF22_MASK                  equ 0040h
C1RXOVIFU_RFOVIF23_POSN                  equ 0007h
C1RXOVIFU_RFOVIF23_POSITION              equ 0007h
C1RXOVIFU_RFOVIF23_SIZE                  equ 0001h
C1RXOVIFU_RFOVIF23_LENGTH                equ 0001h
C1RXOVIFU_RFOVIF23_MASK                  equ 0080h

// Register: C1RXOVIFT
#define C1RXOVIFT C1RXOVIFT
C1RXOVIFT                                equ 012Bh
// bitfield definitions
C1RXOVIFT_RFOVIF_POSN                    equ 0000h
C1RXOVIFT_RFOVIF_POSITION                equ 0000h
C1RXOVIFT_RFOVIF_SIZE                    equ 0008h
C1RXOVIFT_RFOVIF_LENGTH                  equ 0008h
C1RXOVIFT_RFOVIF_MASK                    equ 00FFh
C1RXOVIFT_RFOVIF24_POSN                  equ 0000h
C1RXOVIFT_RFOVIF24_POSITION              equ 0000h
C1RXOVIFT_RFOVIF24_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF24_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF24_MASK                  equ 0001h
C1RXOVIFT_RFOVIF25_POSN                  equ 0001h
C1RXOVIFT_RFOVIF25_POSITION              equ 0001h
C1RXOVIFT_RFOVIF25_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF25_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF25_MASK                  equ 0002h
C1RXOVIFT_RFOVIF26_POSN                  equ 0002h
C1RXOVIFT_RFOVIF26_POSITION              equ 0002h
C1RXOVIFT_RFOVIF26_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF26_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF26_MASK                  equ 0004h
C1RXOVIFT_RFOVIF27_POSN                  equ 0003h
C1RXOVIFT_RFOVIF27_POSITION              equ 0003h
C1RXOVIFT_RFOVIF27_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF27_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF27_MASK                  equ 0008h
C1RXOVIFT_RFOVIF28_POSN                  equ 0004h
C1RXOVIFT_RFOVIF28_POSITION              equ 0004h
C1RXOVIFT_RFOVIF28_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF28_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF28_MASK                  equ 0010h
C1RXOVIFT_RFOVIF29_POSN                  equ 0005h
C1RXOVIFT_RFOVIF29_POSITION              equ 0005h
C1RXOVIFT_RFOVIF29_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF29_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF29_MASK                  equ 0020h
C1RXOVIFT_RFOVIF30_POSN                  equ 0006h
C1RXOVIFT_RFOVIF30_POSITION              equ 0006h
C1RXOVIFT_RFOVIF30_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF30_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF30_MASK                  equ 0040h
C1RXOVIFT_RFOVIF31_POSN                  equ 0007h
C1RXOVIFT_RFOVIF31_POSITION              equ 0007h
C1RXOVIFT_RFOVIF31_SIZE                  equ 0001h
C1RXOVIFT_RFOVIF31_LENGTH                equ 0001h
C1RXOVIFT_RFOVIF31_MASK                  equ 0080h

// Register: C1TXATIF
#define C1TXATIF C1TXATIF
C1TXATIF                                 equ 012Ch

// Register: C1TXATIFL
#define C1TXATIFL C1TXATIFL
C1TXATIFL                                equ 012Ch
// bitfield definitions
C1TXATIFL_TFATIF_POSN                    equ 0000h
C1TXATIFL_TFATIF_POSITION                equ 0000h
C1TXATIFL_TFATIF_SIZE                    equ 0008h
C1TXATIFL_TFATIF_LENGTH                  equ 0008h
C1TXATIFL_TFATIF_MASK                    equ 00FFh
C1TXATIFL_TFATIF0_POSN                   equ 0000h
C1TXATIFL_TFATIF0_POSITION               equ 0000h
C1TXATIFL_TFATIF0_SIZE                   equ 0001h
C1TXATIFL_TFATIF0_LENGTH                 equ 0001h
C1TXATIFL_TFATIF0_MASK                   equ 0001h
C1TXATIFL_TFATIF1_POSN                   equ 0001h
C1TXATIFL_TFATIF1_POSITION               equ 0001h
C1TXATIFL_TFATIF1_SIZE                   equ 0001h
C1TXATIFL_TFATIF1_LENGTH                 equ 0001h
C1TXATIFL_TFATIF1_MASK                   equ 0002h
C1TXATIFL_TFATIF2_POSN                   equ 0002h
C1TXATIFL_TFATIF2_POSITION               equ 0002h
C1TXATIFL_TFATIF2_SIZE                   equ 0001h
C1TXATIFL_TFATIF2_LENGTH                 equ 0001h
C1TXATIFL_TFATIF2_MASK                   equ 0004h
C1TXATIFL_TFATIF3_POSN                   equ 0003h
C1TXATIFL_TFATIF3_POSITION               equ 0003h
C1TXATIFL_TFATIF3_SIZE                   equ 0001h
C1TXATIFL_TFATIF3_LENGTH                 equ 0001h
C1TXATIFL_TFATIF3_MASK                   equ 0008h
C1TXATIFL_TFATIF4_POSN                   equ 0004h
C1TXATIFL_TFATIF4_POSITION               equ 0004h
C1TXATIFL_TFATIF4_SIZE                   equ 0001h
C1TXATIFL_TFATIF4_LENGTH                 equ 0001h
C1TXATIFL_TFATIF4_MASK                   equ 0010h
C1TXATIFL_TFATIF5_POSN                   equ 0005h
C1TXATIFL_TFATIF5_POSITION               equ 0005h
C1TXATIFL_TFATIF5_SIZE                   equ 0001h
C1TXATIFL_TFATIF5_LENGTH                 equ 0001h
C1TXATIFL_TFATIF5_MASK                   equ 0020h
C1TXATIFL_TFATIF6_POSN                   equ 0006h
C1TXATIFL_TFATIF6_POSITION               equ 0006h
C1TXATIFL_TFATIF6_SIZE                   equ 0001h
C1TXATIFL_TFATIF6_LENGTH                 equ 0001h
C1TXATIFL_TFATIF6_MASK                   equ 0040h
C1TXATIFL_TFATIF7_POSN                   equ 0007h
C1TXATIFL_TFATIF7_POSITION               equ 0007h
C1TXATIFL_TFATIF7_SIZE                   equ 0001h
C1TXATIFL_TFATIF7_LENGTH                 equ 0001h
C1TXATIFL_TFATIF7_MASK                   equ 0080h

