GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: C1FLTOBJ2L
#define C1FLTOBJ2L C1FLTOBJ2L
C1FLTOBJ2L                               equ 019Ch
// bitfield definitions
C1FLTOBJ2L_SID_POSN                      equ 0000h
C1FLTOBJ2L_SID_POSITION                  equ 0000h
C1FLTOBJ2L_SID_SIZE                      equ 0008h
C1FLTOBJ2L_SID_LENGTH                    equ 0008h
C1FLTOBJ2L_SID_MASK                      equ 00FFh
C1FLTOBJ2L_SID0_POSN                     equ 0000h
C1FLTOBJ2L_SID0_POSITION                 equ 0000h
C1FLTOBJ2L_SID0_SIZE                     equ 0001h
C1FLTOBJ2L_SID0_LENGTH                   equ 0001h
C1FLTOBJ2L_SID0_MASK                     equ 0001h
C1FLTOBJ2L_SID1_POSN                     equ 0001h
C1FLTOBJ2L_SID1_POSITION                 equ 0001h
C1FLTOBJ2L_SID1_SIZE                     equ 0001h
C1FLTOBJ2L_SID1_LENGTH                   equ 0001h
C1FLTOBJ2L_SID1_MASK                     equ 0002h
C1FLTOBJ2L_SID2_POSN                     equ 0002h
C1FLTOBJ2L_SID2_POSITION                 equ 0002h
C1FLTOBJ2L_SID2_SIZE                     equ 0001h
C1FLTOBJ2L_SID2_LENGTH                   equ 0001h
C1FLTOBJ2L_SID2_MASK                     equ 0004h
C1FLTOBJ2L_SID3_POSN                     equ 0003h
C1FLTOBJ2L_SID3_POSITION                 equ 0003h
C1FLTOBJ2L_SID3_SIZE                     equ 0001h
C1FLTOBJ2L_SID3_LENGTH                   equ 0001h
C1FLTOBJ2L_SID3_MASK                     equ 0008h
C1FLTOBJ2L_SID4_POSN                     equ 0004h
C1FLTOBJ2L_SID4_POSITION                 equ 0004h
C1FLTOBJ2L_SID4_SIZE                     equ 0001h
C1FLTOBJ2L_SID4_LENGTH                   equ 0001h
C1FLTOBJ2L_SID4_MASK                     equ 0010h
C1FLTOBJ2L_SID5_POSN                     equ 0005h
C1FLTOBJ2L_SID5_POSITION                 equ 0005h
C1FLTOBJ2L_SID5_SIZE                     equ 0001h
C1FLTOBJ2L_SID5_LENGTH                   equ 0001h
C1FLTOBJ2L_SID5_MASK                     equ 0020h
C1FLTOBJ2L_SID6_POSN                     equ 0006h
C1FLTOBJ2L_SID6_POSITION                 equ 0006h
C1FLTOBJ2L_SID6_SIZE                     equ 0001h
C1FLTOBJ2L_SID6_LENGTH                   equ 0001h
C1FLTOBJ2L_SID6_MASK                     equ 0040h
C1FLTOBJ2L_SID7_POSN                     equ 0007h
C1FLTOBJ2L_SID7_POSITION                 equ 0007h
C1FLTOBJ2L_SID7_SIZE                     equ 0001h
C1FLTOBJ2L_SID7_LENGTH                   equ 0001h
C1FLTOBJ2L_SID7_MASK                     equ 0080h

// Register: C1FLTOBJ2H
#define C1FLTOBJ2H C1FLTOBJ2H
C1FLTOBJ2H                               equ 019Dh
// bitfield definitions
C1FLTOBJ2H_SID_POSN                      equ 0000h
C1FLTOBJ2H_SID_POSITION                  equ 0000h
C1FLTOBJ2H_SID_SIZE                      equ 0003h
C1FLTOBJ2H_SID_LENGTH                    equ 0003h
C1FLTOBJ2H_SID_MASK                      equ 0007h
C1FLTOBJ2H_EID_POSN                      equ 0003h
C1FLTOBJ2H_EID_POSITION                  equ 0003h
C1FLTOBJ2H_EID_SIZE                      equ 0005h
C1FLTOBJ2H_EID_LENGTH                    equ 0005h
C1FLTOBJ2H_EID_MASK                      equ 00F8h
C1FLTOBJ2H_SID8_POSN                     equ 0000h
C1FLTOBJ2H_SID8_POSITION                 equ 0000h
C1FLTOBJ2H_SID8_SIZE                     equ 0001h
C1FLTOBJ2H_SID8_LENGTH                   equ 0001h
C1FLTOBJ2H_SID8_MASK                     equ 0001h
C1FLTOBJ2H_SID9_POSN                     equ 0001h
C1FLTOBJ2H_SID9_POSITION                 equ 0001h
C1FLTOBJ2H_SID9_SIZE                     equ 0001h
C1FLTOBJ2H_SID9_LENGTH                   equ 0001h
C1FLTOBJ2H_SID9_MASK                     equ 0002h
C1FLTOBJ2H_SID10_POSN                    equ 0002h
C1FLTOBJ2H_SID10_POSITION                equ 0002h
C1FLTOBJ2H_SID10_SIZE                    equ 0001h
C1FLTOBJ2H_SID10_LENGTH                  equ 0001h
C1FLTOBJ2H_SID10_MASK                    equ 0004h
C1FLTOBJ2H_EID0_POSN                     equ 0003h
C1FLTOBJ2H_EID0_POSITION                 equ 0003h
C1FLTOBJ2H_EID0_SIZE                     equ 0001h
C1FLTOBJ2H_EID0_LENGTH                   equ 0001h
C1FLTOBJ2H_EID0_MASK                     equ 0008h
C1FLTOBJ2H_EID1_POSN                     equ 0004h
C1FLTOBJ2H_EID1_POSITION                 equ 0004h
C1FLTOBJ2H_EID1_SIZE                     equ 0001h
C1FLTOBJ2H_EID1_LENGTH                   equ 0001h
C1FLTOBJ2H_EID1_MASK                     equ 0010h
C1FLTOBJ2H_EID2_POSN                     equ 0005h
C1FLTOBJ2H_EID2_POSITION                 equ 0005h
C1FLTOBJ2H_EID2_SIZE                     equ 0001h
C1FLTOBJ2H_EID2_LENGTH                   equ 0001h
C1FLTOBJ2H_EID2_MASK                     equ 0020h
C1FLTOBJ2H_EID3_POSN                     equ 0006h
C1FLTOBJ2H_EID3_POSITION                 equ 0006h
C1FLTOBJ2H_EID3_SIZE                     equ 0001h
C1FLTOBJ2H_EID3_LENGTH                   equ 0001h
C1FLTOBJ2H_EID3_MASK                     equ 0040h
C1FLTOBJ2H_EID4_POSN                     equ 0007h
C1FLTOBJ2H_EID4_POSITION                 equ 0007h
C1FLTOBJ2H_EID4_SIZE                     equ 0001h
C1FLTOBJ2H_EID4_LENGTH                   equ 0001h
C1FLTOBJ2H_EID4_MASK                     equ 0080h

// Register: C1FLTOBJ2U
#define C1FLTOBJ2U C1FLTOBJ2U
C1FLTOBJ2U                               equ 019Eh
// bitfield definitions
C1FLTOBJ2U_EID_POSN                      equ 0000h
C1FLTOBJ2U_EID_POSITION                  equ 0000h
C1FLTOBJ2U_EID_SIZE                      equ 0008h
C1FLTOBJ2U_EID_LENGTH                    equ 0008h
C1FLTOBJ2U_EID_MASK                      equ 00FFh
C1FLTOBJ2U_EID5_POSN                     equ 0000h
C1FLTOBJ2U_EID5_POSITION                 equ 0000h
C1FLTOBJ2U_EID5_SIZE                     equ 0001h
C1FLTOBJ2U_EID5_LENGTH                   equ 0001h
C1FLTOBJ2U_EID5_MASK                     equ 0001h
C1FLTOBJ2U_EID6_POSN                     equ 0001h
C1FLTOBJ2U_EID6_POSITION                 equ 0001h
C1FLTOBJ2U_EID6_SIZE                     equ 0001h
C1FLTOBJ2U_EID6_LENGTH                   equ 0001h
C1FLTOBJ2U_EID6_MASK                     equ 0002h
C1FLTOBJ2U_EID7_POSN                     equ 0002h
C1FLTOBJ2U_EID7_POSITION                 equ 0002h
C1FLTOBJ2U_EID7_SIZE                     equ 0001h
C1FLTOBJ2U_EID7_LENGTH                   equ 0001h
C1FLTOBJ2U_EID7_MASK                     equ 0004h
C1FLTOBJ2U_EID8_POSN                     equ 0003h
C1FLTOBJ2U_EID8_POSITION                 equ 0003h
C1FLTOBJ2U_EID8_SIZE                     equ 0001h
C1FLTOBJ2U_EID8_LENGTH                   equ 0001h
C1FLTOBJ2U_EID8_MASK                     equ 0008h
C1FLTOBJ2U_EID9_POSN                     equ 0004h
C1FLTOBJ2U_EID9_POSITION                 equ 0004h
C1FLTOBJ2U_EID9_SIZE                     equ 0001h
C1FLTOBJ2U_EID9_LENGTH                   equ 0001h
C1FLTOBJ2U_EID9_MASK                     equ 0010h
C1FLTOBJ2U_EID10_POSN                    equ 0005h
C1FLTOBJ2U_EID10_POSITION                equ 0005h
C1FLTOBJ2U_EID10_SIZE                    equ 0001h
C1FLTOBJ2U_EID10_LENGTH                  equ 0001h
C1FLTOBJ2U_EID10_MASK                    equ 0020h
C1FLTOBJ2U_EID11_POSN                    equ 0006h
C1FLTOBJ2U_EID11_POSITION                equ 0006h
C1FLTOBJ2U_EID11_SIZE                    equ 0001h
C1FLTOBJ2U_EID11_LENGTH                  equ 0001h
C1FLTOBJ2U_EID11_MASK                    equ 0040h
C1FLTOBJ2U_EID12_POSN                    equ 0007h
C1FLTOBJ2U_EID12_POSITION                equ 0007h
C1FLTOBJ2U_EID12_SIZE                    equ 0001h
C1FLTOBJ2U_EID12_LENGTH                  equ 0001h
C1FLTOBJ2U_EID12_MASK                    equ 0080h

