GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: RC3PPS
#define RC3PPS RC3PPS
RC3PPS                                   equ 0214h
// bitfield definitions
RC3PPS_RC3PPS0_POSN                      equ 0000h
RC3PPS_RC3PPS0_POSITION                  equ 0000h
RC3PPS_RC3PPS0_SIZE                      equ 0001h
RC3PPS_RC3PPS0_LENGTH                    equ 0001h
RC3PPS_RC3PPS0_MASK                      equ 0001h
RC3PPS_RC3PPS1_POSN                      equ 0001h
RC3PPS_RC3PPS1_POSITION                  equ 0001h
RC3PPS_RC3PPS1_SIZE                      equ 0001h
RC3PPS_RC3PPS1_LENGTH                    equ 0001h
RC3PPS_RC3PPS1_MASK                      equ 0002h
RC3PPS_RC3PPS2_POSN                      equ 0002h
RC3PPS_RC3PPS2_POSITION                  equ 0002h
RC3PPS_RC3PPS2_SIZE                      equ 0001h
RC3PPS_RC3PPS2_LENGTH                    equ 0001h
RC3PPS_RC3PPS2_MASK                      equ 0004h
RC3PPS_RC3PPS3_POSN                      equ 0003h
RC3PPS_RC3PPS3_POSITION                  equ 0003h
RC3PPS_RC3PPS3_SIZE                      equ 0001h
RC3PPS_RC3PPS3_LENGTH                    equ 0001h
RC3PPS_RC3PPS3_MASK                      equ 0008h
RC3PPS_RC3PPS4_POSN                      equ 0004h
RC3PPS_RC3PPS4_POSITION                  equ 0004h
RC3PPS_RC3PPS4_SIZE                      equ 0001h
RC3PPS_RC3PPS4_LENGTH                    equ 0001h
RC3PPS_RC3PPS4_MASK                      equ 0010h
RC3PPS_RC3PPS5_POSN                      equ 0005h
RC3PPS_RC3PPS5_POSITION                  equ 0005h
RC3PPS_RC3PPS5_SIZE                      equ 0001h
RC3PPS_RC3PPS5_LENGTH                    equ 0001h
RC3PPS_RC3PPS5_MASK                      equ 0020h

// Register: RC4PPS
#define RC4PPS RC4PPS
RC4PPS                                   equ 0215h
// bitfield definitions
RC4PPS_RC4PPS0_POSN                      equ 0000h
RC4PPS_RC4PPS0_POSITION                  equ 0000h
RC4PPS_RC4PPS0_SIZE                      equ 0001h
RC4PPS_RC4PPS0_LENGTH                    equ 0001h
RC4PPS_RC4PPS0_MASK                      equ 0001h
RC4PPS_RC4PPS1_POSN                      equ 0001h
RC4PPS_RC4PPS1_POSITION                  equ 0001h
RC4PPS_RC4PPS1_SIZE                      equ 0001h
RC4PPS_RC4PPS1_LENGTH                    equ 0001h
RC4PPS_RC4PPS1_MASK                      equ 0002h
RC4PPS_RC4PPS2_POSN                      equ 0002h
RC4PPS_RC4PPS2_POSITION                  equ 0002h
RC4PPS_RC4PPS2_SIZE                      equ 0001h
RC4PPS_RC4PPS2_LENGTH                    equ 0001h
RC4PPS_RC4PPS2_MASK                      equ 0004h
RC4PPS_RC4PPS3_POSN                      equ 0003h
RC4PPS_RC4PPS3_POSITION                  equ 0003h
RC4PPS_RC4PPS3_SIZE                      equ 0001h
RC4PPS_RC4PPS3_LENGTH                    equ 0001h
RC4PPS_RC4PPS3_MASK                      equ 0008h
RC4PPS_RC4PPS4_POSN                      equ 0004h
RC4PPS_RC4PPS4_POSITION                  equ 0004h
RC4PPS_RC4PPS4_SIZE                      equ 0001h
RC4PPS_RC4PPS4_LENGTH                    equ 0001h
RC4PPS_RC4PPS4_MASK                      equ 0010h
RC4PPS_RC4PPS5_POSN                      equ 0005h
RC4PPS_RC4PPS5_POSITION                  equ 0005h
RC4PPS_RC4PPS5_SIZE                      equ 0001h
RC4PPS_RC4PPS5_LENGTH                    equ 0001h
RC4PPS_RC4PPS5_MASK                      equ 0020h

// Register: RC5PPS
#define RC5PPS RC5PPS
RC5PPS                                   equ 0216h
// bitfield definitions
RC5PPS_RC5PPS0_POSN                      equ 0000h
RC5PPS_RC5PPS0_POSITION                  equ 0000h
RC5PPS_RC5PPS0_SIZE                      equ 0001h
RC5PPS_RC5PPS0_LENGTH                    equ 0001h
RC5PPS_RC5PPS0_MASK                      equ 0001h
RC5PPS_RC5PPS1_POSN                      equ 0001h
RC5PPS_RC5PPS1_POSITION                  equ 0001h
RC5PPS_RC5PPS1_SIZE                      equ 0001h
RC5PPS_RC5PPS1_LENGTH                    equ 0001h
RC5PPS_RC5PPS1_MASK                      equ 0002h
RC5PPS_RC5PPS2_POSN                      equ 0002h
RC5PPS_RC5PPS2_POSITION                  equ 0002h
RC5PPS_RC5PPS2_SIZE                      equ 0001h
RC5PPS_RC5PPS2_LENGTH                    equ 0001h
RC5PPS_RC5PPS2_MASK                      equ 0004h
RC5PPS_RC5PPS3_POSN                      equ 0003h
RC5PPS_RC5PPS3_POSITION                  equ 0003h
RC5PPS_RC5PPS3_SIZE                      equ 0001h
RC5PPS_RC5PPS3_LENGTH                    equ 0001h
RC5PPS_RC5PPS3_MASK                      equ 0008h
RC5PPS_RC5PPS4_POSN                      equ 0004h
RC5PPS_RC5PPS4_POSITION                  equ 0004h
RC5PPS_RC5PPS4_SIZE                      equ 0001h
RC5PPS_RC5PPS4_LENGTH                    equ 0001h
RC5PPS_RC5PPS4_MASK                      equ 0010h
RC5PPS_RC5PPS5_POSN                      equ 0005h
RC5PPS_RC5PPS5_POSITION                  equ 0005h
RC5PPS_RC5PPS5_SIZE                      equ 0001h
RC5PPS_RC5PPS5_LENGTH                    equ 0001h
RC5PPS_RC5PPS5_MASK                      equ 0020h

// Register: RC6PPS
#define RC6PPS RC6PPS
RC6PPS                                   equ 0217h
// bitfield definitions
RC6PPS_RC6PPS0_POSN                      equ 0000h
RC6PPS_RC6PPS0_POSITION                  equ 0000h
RC6PPS_RC6PPS0_SIZE                      equ 0001h
RC6PPS_RC6PPS0_LENGTH                    equ 0001h
RC6PPS_RC6PPS0_MASK                      equ 0001h
RC6PPS_RC6PPS1_POSN                      equ 0001h
RC6PPS_RC6PPS1_POSITION                  equ 0001h
RC6PPS_RC6PPS1_SIZE                      equ 0001h
RC6PPS_RC6PPS1_LENGTH                    equ 0001h
RC6PPS_RC6PPS1_MASK                      equ 0002h
RC6PPS_RC6PPS2_POSN                      equ 0002h
RC6PPS_RC6PPS2_POSITION                  equ 0002h
RC6PPS_RC6PPS2_SIZE                      equ 0001h
RC6PPS_RC6PPS2_LENGTH                    equ 0001h
RC6PPS_RC6PPS2_MASK                      equ 0004h
RC6PPS_RC6PPS3_POSN                      equ 0003h
RC6PPS_RC6PPS3_POSITION                  equ 0003h
RC6PPS_RC6PPS3_SIZE                      equ 0001h
RC6PPS_RC6PPS3_LENGTH                    equ 0001h
RC6PPS_RC6PPS3_MASK                      equ 0008h
RC6PPS_RC6PPS4_POSN                      equ 0004h
RC6PPS_RC6PPS4_POSITION                  equ 0004h
RC6PPS_RC6PPS4_SIZE                      equ 0001h
RC6PPS_RC6PPS4_LENGTH                    equ 0001h
RC6PPS_RC6PPS4_MASK                      equ 0010h
RC6PPS_RC6PPS5_POSN                      equ 0005h
RC6PPS_RC6PPS5_POSITION                  equ 0005h
RC6PPS_RC6PPS5_SIZE                      equ 0001h
RC6PPS_RC6PPS5_LENGTH                    equ 0001h
RC6PPS_RC6PPS5_MASK                      equ 0020h

// Register: RC7PPS
#define RC7PPS RC7PPS
RC7PPS                                   equ 0218h
// bitfield definitions
RC7PPS_RC7PPS0_POSN                      equ 0000h
RC7PPS_RC7PPS0_POSITION                  equ 0000h
RC7PPS_RC7PPS0_SIZE                      equ 0001h
RC7PPS_RC7PPS0_LENGTH                    equ 0001h
RC7PPS_RC7PPS0_MASK                      equ 0001h
RC7PPS_RC7PPS1_POSN                      equ 0001h
RC7PPS_RC7PPS1_POSITION                  equ 0001h
RC7PPS_RC7PPS1_SIZE                      equ 0001h
RC7PPS_RC7PPS1_LENGTH                    equ 0001h
RC7PPS_RC7PPS1_MASK                      equ 0002h
RC7PPS_RC7PPS2_POSN                      equ 0002h
RC7PPS_RC7PPS2_POSITION                  equ 0002h
RC7PPS_RC7PPS2_SIZE                      equ 0001h
RC7PPS_RC7PPS2_LENGTH                    equ 0001h
RC7PPS_RC7PPS2_MASK                      equ 0004h
RC7PPS_RC7PPS3_POSN                      equ 0003h
RC7PPS_RC7PPS3_POSITION                  equ 0003h
RC7PPS_RC7PPS3_SIZE                      equ 0001h
RC7PPS_RC7PPS3_LENGTH                    equ 0001h
RC7PPS_RC7PPS3_MASK                      equ 0008h
RC7PPS_RC7PPS4_POSN                      equ 0004h
RC7PPS_RC7PPS4_POSITION                  equ 0004h
RC7PPS_RC7PPS4_SIZE                      equ 0001h
RC7PPS_RC7PPS4_LENGTH                    equ 0001h
RC7PPS_RC7PPS4_MASK                      equ 0010h
RC7PPS_RC7PPS5_POSN                      equ 0005h
RC7PPS_RC7PPS5_POSITION                  equ 0005h
RC7PPS_RC7PPS5_SIZE                      equ 0001h
RC7PPS_RC7PPS5_LENGTH                    equ 0001h
RC7PPS_RC7PPS5_MASK                      equ 0020h

// Register: CANRXPPS
#define CANRXPPS CANRXPPS
CANRXPPS                                 equ 023Dh
// bitfield definitions
CANRXPPS_PIN_POSN                        equ 0000h
CANRXPPS_PIN_POSITION                    equ 0000h
CANRXPPS_PIN_SIZE                        equ 0003h
CANRXPPS_PIN_LENGTH                      equ 0003h
CANRXPPS_PIN_MASK                        equ 0007h
CANRXPPS_PORT_POSN                       equ 0003h
CANRXPPS_PORT_POSITION                   equ 0003h
CANRXPPS_PORT_SIZE                       equ 0002h
CANRXPPS_PORT_LENGTH                     equ 0002h
CANRXPPS_PORT_MASK                       equ 0018h
CANRXPPS_CANRXPPS0_POSN                  equ 0000h
CANRXPPS_CANRXPPS0_POSITION              equ 0000h
CANRXPPS_CANRXPPS0_SIZE                  equ 0001h
CANRXPPS_CANRXPPS0_LENGTH                equ 0001h
CANRXPPS_CANRXPPS0_MASK                  equ 0001h
CANRXPPS_CANRXPPS1_POSN                  equ 0001h
CANRXPPS_CANRXPPS1_POSITION              equ 0001h
CANRXPPS_CANRXPPS1_SIZE                  equ 0001h
CANRXPPS_CANRXPPS1_LENGTH                equ 0001h
CANRXPPS_CANRXPPS1_MASK                  equ 0002h
CANRXPPS_CANRXPPS2_POSN                  equ 0002h
CANRXPPS_CANRXPPS2_POSITION              equ 0002h
CANRXPPS_CANRXPPS2_SIZE                  equ 0001h
CANRXPPS_CANRXPPS2_LENGTH                equ 0001h
CANRXPPS_CANRXPPS2_MASK                  equ 0004h
CANRXPPS_CANRXPPS3_POSN                  equ 0003h
CANRXPPS_CANRXPPS3_POSITION              equ 0003h
CANRXPPS_CANRXPPS3_SIZE                  equ 0001h
CANRXPPS_CANRXPPS3_LENGTH                equ 0001h
CANRXPPS_CANRXPPS3_MASK                  equ 0008h
CANRXPPS_CANRXPPS4_POSN                  equ 0004h
CANRXPPS_CANRXPPS4_POSITION              equ 0004h
CANRXPPS_CANRXPPS4_SIZE                  equ 0001h
CANRXPPS_CANRXPPS4_LENGTH                equ 0001h
CANRXPPS_CANRXPPS4_MASK                  equ 0010h
CANRXPPS_CANRXPPS_POSN                   equ 0000h
CANRXPPS_CANRXPPS_POSITION               equ 0000h
CANRXPPS_CANRXPPS_SIZE                   equ 0005h
CANRXPPS_CANRXPPS_LENGTH                 equ 0005h
CANRXPPS_CANRXPPS_MASK                   equ 001Fh

