GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
// Register: CCPR3L
#define CCPR3L CCPR3L
CCPR3L                                   equ 0348h
// bitfield definitions
CCPR3L_RL_POSN                           equ 0000h
CCPR3L_RL_POSITION                       equ 0000h
CCPR3L_RL_SIZE                           equ 0008h
CCPR3L_RL_LENGTH                         equ 0008h
CCPR3L_RL_MASK                           equ 00FFh

// Register: CCPR3H
#define CCPR3H CCPR3H
CCPR3H                                   equ 0349h
// bitfield definitions
CCPR3H_RH_POSN                           equ 0000h
CCPR3H_RH_POSITION                       equ 0000h
CCPR3H_RH_SIZE                           equ 0008h
CCPR3H_RH_LENGTH                         equ 0008h
CCPR3H_RH_MASK                           equ 00FFh

// Register: CCP3CON
#define CCP3CON CCP3CON
CCP3CON                                  equ 034Ah
// bitfield definitions
CCP3CON_MODE_POSN                        equ 0000h
CCP3CON_MODE_POSITION                    equ 0000h
CCP3CON_MODE_SIZE                        equ 0004h
CCP3CON_MODE_LENGTH                      equ 0004h
CCP3CON_MODE_MASK                        equ 000Fh
CCP3CON_FMT_POSN                         equ 0004h
CCP3CON_FMT_POSITION                     equ 0004h
CCP3CON_FMT_SIZE                         equ 0001h
CCP3CON_FMT_LENGTH                       equ 0001h
CCP3CON_FMT_MASK                         equ 0010h
CCP3CON_OUT_POSN                         equ 0005h
CCP3CON_OUT_POSITION                     equ 0005h
CCP3CON_OUT_SIZE                         equ 0001h
CCP3CON_OUT_LENGTH                       equ 0001h
CCP3CON_OUT_MASK                         equ 0020h
CCP3CON_EN_POSN                          equ 0007h
CCP3CON_EN_POSITION                      equ 0007h
CCP3CON_EN_SIZE                          equ 0001h
CCP3CON_EN_LENGTH                        equ 0001h
CCP3CON_EN_MASK                          equ 0080h
CCP3CON_MODE0_POSN                       equ 0000h
CCP3CON_MODE0_POSITION                   equ 0000h
CCP3CON_MODE0_SIZE                       equ 0001h
CCP3CON_MODE0_LENGTH                     equ 0001h
CCP3CON_MODE0_MASK                       equ 0001h
CCP3CON_MODE1_POSN                       equ 0001h
CCP3CON_MODE1_POSITION                   equ 0001h
CCP3CON_MODE1_SIZE                       equ 0001h
CCP3CON_MODE1_LENGTH                     equ 0001h
CCP3CON_MODE1_MASK                       equ 0002h
CCP3CON_MODE2_POSN                       equ 0002h
CCP3CON_MODE2_POSITION                   equ 0002h
CCP3CON_MODE2_SIZE                       equ 0001h
CCP3CON_MODE2_LENGTH                     equ 0001h
CCP3CON_MODE2_MASK                       equ 0004h
CCP3CON_MODE3_POSN                       equ 0003h
CCP3CON_MODE3_POSITION                   equ 0003h
CCP3CON_MODE3_SIZE                       equ 0001h
CCP3CON_MODE3_LENGTH                     equ 0001h
CCP3CON_MODE3_MASK                       equ 0008h
CCP3CON_CCP3MODE_POSN                    equ 0000h
CCP3CON_CCP3MODE_POSITION                equ 0000h
CCP3CON_CCP3MODE_SIZE                    equ 0004h
CCP3CON_CCP3MODE_LENGTH                  equ 0004h
CCP3CON_CCP3MODE_MASK                    equ 000Fh
CCP3CON_CCP3FMT_POSN                     equ 0004h
CCP3CON_CCP3FMT_POSITION                 equ 0004h
CCP3CON_CCP3FMT_SIZE                     equ 0001h
CCP3CON_CCP3FMT_LENGTH                   equ 0001h
CCP3CON_CCP3FMT_MASK                     equ 0010h
CCP3CON_CCP3OUT_POSN                     equ 0005h
CCP3CON_CCP3OUT_POSITION                 equ 0005h
CCP3CON_CCP3OUT_SIZE                     equ 0001h
CCP3CON_CCP3OUT_LENGTH                   equ 0001h
CCP3CON_CCP3OUT_MASK                     equ 0020h
CCP3CON_CCP3EN_POSN                      equ 0007h
CCP3CON_CCP3EN_POSITION                  equ 0007h
CCP3CON_CCP3EN_SIZE                      equ 0001h
CCP3CON_CCP3EN_LENGTH                    equ 0001h
CCP3CON_CCP3EN_MASK                      equ 0080h
CCP3CON_CCP3MODE0_POSN                   equ 0000h
CCP3CON_CCP3MODE0_POSITION               equ 0000h
CCP3CON_CCP3MODE0_SIZE                   equ 0001h
CCP3CON_CCP3MODE0_LENGTH                 equ 0001h
CCP3CON_CCP3MODE0_MASK                   equ 0001h
CCP3CON_CCP3MODE1_POSN                   equ 0001h
CCP3CON_CCP3MODE1_POSITION               equ 0001h
CCP3CON_CCP3MODE1_SIZE                   equ 0001h
CCP3CON_CCP3MODE1_LENGTH                 equ 0001h
CCP3CON_CCP3MODE1_MASK                   equ 0002h
CCP3CON_CCP3MODE2_POSN                   equ 0002h
CCP3CON_CCP3MODE2_POSITION               equ 0002h
CCP3CON_CCP3MODE2_SIZE                   equ 0001h
CCP3CON_CCP3MODE2_LENGTH                 equ 0001h
CCP3CON_CCP3MODE2_MASK                   equ 0004h
CCP3CON_CCP3MODE3_POSN                   equ 0003h
CCP3CON_CCP3MODE3_POSITION               equ 0003h
CCP3CON_CCP3MODE3_SIZE                   equ 0001h
CCP3CON_CCP3MODE3_LENGTH                 equ 0001h
CCP3CON_CCP3MODE3_MASK                   equ 0008h

// Register: CCP3CAP
#define CCP3CAP CCP3CAP
CCP3CAP                                  equ 034Bh
// bitfield definitions
CCP3CAP_CTS_POSN                         equ 0000h
CCP3CAP_CTS_POSITION                     equ 0000h
CCP3CAP_CTS_SIZE                         equ 0008h
CCP3CAP_CTS_LENGTH                       equ 0008h
CCP3CAP_CTS_MASK                         equ 00FFh
CCP3CAP_CTS0_POSN                        equ 0000h
CCP3CAP_CTS0_POSITION                    equ 0000h
CCP3CAP_CTS0_SIZE                        equ 0001h
CCP3CAP_CTS0_LENGTH                      equ 0001h
CCP3CAP_CTS0_MASK                        equ 0001h
CCP3CAP_CTS1_POSN                        equ 0001h
CCP3CAP_CTS1_POSITION                    equ 0001h
CCP3CAP_CTS1_SIZE                        equ 0001h
CCP3CAP_CTS1_LENGTH                      equ 0001h
CCP3CAP_CTS1_MASK                        equ 0002h
CCP3CAP_CTS2_POSN                        equ 0002h
CCP3CAP_CTS2_POSITION                    equ 0002h
CCP3CAP_CTS2_SIZE                        equ 0001h
CCP3CAP_CTS2_LENGTH                      equ 0001h
CCP3CAP_CTS2_MASK                        equ 0004h
CCP3CAP_CTS3_POSN                        equ 0003h
CCP3CAP_CTS3_POSITION                    equ 0003h
CCP3CAP_CTS3_SIZE                        equ 0001h
CCP3CAP_CTS3_LENGTH                      equ 0001h
CCP3CAP_CTS3_MASK                        equ 0008h
CCP3CAP_CCP3CTS_POSN                     equ 0000h
CCP3CAP_CCP3CTS_POSITION                 equ 0000h
CCP3CAP_CCP3CTS_SIZE                     equ 0008h
CCP3CAP_CCP3CTS_LENGTH                   equ 0008h
CCP3CAP_CCP3CTS_MASK                     equ 00FFh
CCP3CAP_CCP3CTS0_POSN                    equ 0000h
CCP3CAP_CCP3CTS0_POSITION                equ 0000h
CCP3CAP_CCP3CTS0_SIZE                    equ 0001h
CCP3CAP_CCP3CTS0_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS0_MASK                    equ 0001h
CCP3CAP_CCP3CTS1_POSN                    equ 0001h
CCP3CAP_CCP3CTS1_POSITION                equ 0001h
CCP3CAP_CCP3CTS1_SIZE                    equ 0001h
CCP3CAP_CCP3CTS1_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS1_MASK                    equ 0002h
CCP3CAP_CCP3CTS2_POSN                    equ 0002h
CCP3CAP_CCP3CTS2_POSITION                equ 0002h
CCP3CAP_CCP3CTS2_SIZE                    equ 0001h
CCP3CAP_CCP3CTS2_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS2_MASK                    equ 0004h
CCP3CAP_CCP3CTS3_POSN                    equ 0003h
CCP3CAP_CCP3CTS3_POSITION                equ 0003h
CCP3CAP_CCP3CTS3_SIZE                    equ 0001h
CCP3CAP_CCP3CTS3_LENGTH                  equ 0001h
CCP3CAP_CCP3CTS3_MASK                    equ 0008h

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
CCPTMRS0                                 equ 034Ch
// bitfield definitions
CCPTMRS0_C1TSEL_POSN                     equ 0000h
CCPTMRS0_C1TSEL_POSITION                 equ 0000h
CCPTMRS0_C1TSEL_SIZE                     equ 0002h
CCPTMRS0_C1TSEL_LENGTH                   equ 0002h
CCPTMRS0_C1TSEL_MASK                     equ 0003h
CCPTMRS0_C2TSEL_POSN                     equ 0002h
CCPTMRS0_C2TSEL_POSITION                 equ 0002h
CCPTMRS0_C2TSEL_SIZE                     equ 0002h
CCPTMRS0_C2TSEL_LENGTH                   equ 0002h
CCPTMRS0_C2TSEL_MASK                     equ 000Ch
CCPTMRS0_C3TSEL_POSN                     equ 0004h
CCPTMRS0_C3TSEL_POSITION                 equ 0004h
CCPTMRS0_C3TSEL_SIZE                     equ 0002h
CCPTMRS0_C3TSEL_LENGTH                   equ 0002h
CCPTMRS0_C3TSEL_MASK                     equ 0030h
CCPTMRS0_C1TSEL0_POSN                    equ 0000h
CCPTMRS0_C1TSEL0_POSITION                equ 0000h
CCPTMRS0_C1TSEL0_SIZE                    equ 0001h
CCPTMRS0_C1TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL0_MASK                    equ 0001h
CCPTMRS0_C1TSEL1_POSN                    equ 0001h
CCPTMRS0_C1TSEL1_POSITION                equ 0001h
CCPTMRS0_C1TSEL1_SIZE                    equ 0001h
CCPTMRS0_C1TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C1TSEL1_MASK                    equ 0002h
CCPTMRS0_C2TSEL0_POSN                    equ 0002h
CCPTMRS0_C2TSEL0_POSITION                equ 0002h
CCPTMRS0_C2TSEL0_SIZE                    equ 0001h
CCPTMRS0_C2TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL0_MASK                    equ 0004h
CCPTMRS0_C2TSEL1_POSN                    equ 0003h
CCPTMRS0_C2TSEL1_POSITION                equ 0003h
CCPTMRS0_C2TSEL1_SIZE                    equ 0001h
CCPTMRS0_C2TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C2TSEL1_MASK                    equ 0008h
CCPTMRS0_C3TSEL0_POSN                    equ 0004h
CCPTMRS0_C3TSEL0_POSITION                equ 0004h
CCPTMRS0_C3TSEL0_SIZE                    equ 0001h
CCPTMRS0_C3TSEL0_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL0_MASK                    equ 0010h
CCPTMRS0_C3TSEL1_POSN                    equ 0005h
CCPTMRS0_C3TSEL1_POSITION                equ 0005h
CCPTMRS0_C3TSEL1_SIZE                    equ 0001h
CCPTMRS0_C3TSEL1_LENGTH                  equ 0001h
CCPTMRS0_C3TSEL1_MASK                    equ 0020h

