GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
#define I2CBTOC3                         BANKMASK(I2C1BTOC), 3, b
#define I2CCLK0                          BANKMASK(I2C1CLK), 0, b
#define I2CCLK1                          BANKMASK(I2C1CLK), 1, b
#define I2CCLK2                          BANKMASK(I2C1CLK), 2, b
#define I2CCLK3                          BANKMASK(I2C1CLK), 3, b
#define I2CCLK4                          BANKMASK(I2C1CLK), 4, b
#define I2CEN                            BANKMASK(I2C1CON0), 7, b
#define IDLEN                            BANKMASK(CPUDOZE), 7, a
#define INLVLA0                          BANKMASK(INLVLA), 0, b
#define INLVLA1                          BANKMASK(INLVLA), 1, b
#define INLVLA2                          BANKMASK(INLVLA), 2, b
#define INLVLA3                          BANKMASK(INLVLA), 3, b
#define INLVLA4                          BANKMASK(INLVLA), 4, b
#define INLVLA5                          BANKMASK(INLVLA), 5, b
#define INLVLA6                          BANKMASK(INLVLA), 6, b
#define INLVLA7                          BANKMASK(INLVLA), 7, b
#define INLVLB0                          BANKMASK(INLVLB), 0, b
#define INLVLB1                          BANKMASK(INLVLB), 1, b
#define INLVLB2                          BANKMASK(INLVLB), 2, b
#define INLVLB3                          BANKMASK(INLVLB), 3, b
#define INLVLB4                          BANKMASK(INLVLB), 4, b
#define INLVLB5                          BANKMASK(INLVLB), 5, b
#define INLVLB6                          BANKMASK(INLVLB), 6, b
#define INLVLB7                          BANKMASK(INLVLB), 7, b
#define INLVLC0                          BANKMASK(INLVLC), 0, b
#define INLVLC1                          BANKMASK(INLVLC), 1, b
#define INLVLC2                          BANKMASK(INLVLC), 2, b
#define INLVLC3                          BANKMASK(INLVLC), 3, b
#define INLVLC4                          BANKMASK(INLVLC), 4, b
#define INLVLC5                          BANKMASK(INLVLC), 5, b
#define INLVLC6                          BANKMASK(INLVLC), 6, b
#define INLVLC7                          BANKMASK(INLVLC), 7, b
#define INLVLE3                          BANKMASK(INLVLE), 3, b
#define INT0EDG                          BANKMASK(INTCON0), 0, a
#define INT0IE                           BANKMASK(PIE1), 0, a
#define INT0IF                           BANKMASK(PIR1), 0, a
#define INT0IP                           BANKMASK(IPR1), 0, b
#define INT0PPS0                         BANKMASK(INT0PPS), 0, b
#define INT0PPS1                         BANKMASK(INT0PPS), 1, b
#define INT0PPS2                         BANKMASK(INT0PPS), 2, b
#define INT0PPS3                         BANKMASK(INT0PPS), 3, b
#define INT1EDG                          BANKMASK(INTCON0), 1, a
#define INT1IE                           BANKMASK(PIE6), 0, a
#define INT1IF                           BANKMASK(PIR6), 0, a
#define INT1IP                           BANKMASK(IPR6), 0, b
#define INT1PPS0                         BANKMASK(INT1PPS), 0, b
#define INT1PPS1                         BANKMASK(INT1PPS), 1, b
#define INT1PPS2                         BANKMASK(INT1PPS), 2, b
#define INT1PPS3                         BANKMASK(INT1PPS), 3, b
#define INT1PPS4                         BANKMASK(INT1PPS), 4, b
#define INT2EDG                          BANKMASK(INTCON0), 2, a
#define INT2IE                           BANKMASK(PIE10), 0, a
#define INT2IF                           BANKMASK(PIR10), 0, a
#define INT2IP                           BANKMASK(IPR10), 0, b
#define INT2PPS0                         BANKMASK(INT2PPS), 0, b
#define INT2PPS1                         BANKMASK(INT2PPS), 1, b
#define INT2PPS2                         BANKMASK(INT2PPS), 2, b
#define INT2PPS3                         BANKMASK(INT2PPS), 3, b
#define INT2PPS4                         BANKMASK(INT2PPS), 4, b
#define INT2PPS5                         BANKMASK(INT2PPS), 5, b
#define INTH                             BANKMASK(HLVDCON0), 1, b
#define INTL                             BANKMASK(HLVDCON0), 0, b
#define IOCAF0                           BANKMASK(IOCAF), 0, b
#define IOCAF1                           BANKMASK(IOCAF), 1, b
#define IOCAF2                           BANKMASK(IOCAF), 2, b
#define IOCAF3                           BANKMASK(IOCAF), 3, b
#define IOCAF4                           BANKMASK(IOCAF), 4, b
#define IOCAF5                           BANKMASK(IOCAF), 5, b
#define IOCAF6                           BANKMASK(IOCAF), 6, b
#define IOCAF7                           BANKMASK(IOCAF), 7, b
#define IOCAN0                           BANKMASK(IOCAN), 0, b
#define IOCAN1                           BANKMASK(IOCAN), 1, b
#define IOCAN2                           BANKMASK(IOCAN), 2, b
#define IOCAN3                           BANKMASK(IOCAN), 3, b
#define IOCAN4                           BANKMASK(IOCAN), 4, b
#define IOCAN5                           BANKMASK(IOCAN), 5, b
#define IOCAN6                           BANKMASK(IOCAN), 6, b
#define IOCAN7                           BANKMASK(IOCAN), 7, b
#define IOCAP0                           BANKMASK(IOCAP), 0, b
#define IOCAP1                           BANKMASK(IOCAP), 1, b
#define IOCAP2                           BANKMASK(IOCAP), 2, b
#define IOCAP3                           BANKMASK(IOCAP), 3, b
#define IOCAP4                           BANKMASK(IOCAP), 4, b
#define IOCAP5                           BANKMASK(IOCAP), 5, b
#define IOCAP6                           BANKMASK(IOCAP), 6, b
#define IOCAP7                           BANKMASK(IOCAP), 7, b
#define IOCBF0                           BANKMASK(IOCBF), 0, b
#define IOCBF1                           BANKMASK(IOCBF), 1, b
#define IOCBF2                           BANKMASK(IOCBF), 2, b
#define IOCBF3                           BANKMASK(IOCBF), 3, b
#define IOCBF4                           BANKMASK(IOCBF), 4, b
#define IOCBF5                           BANKMASK(IOCBF), 5, b
#define IOCBF6                           BANKMASK(IOCBF), 6, b
#define IOCBF7                           BANKMASK(IOCBF), 7, b
#define IOCBN0                           BANKMASK(IOCBN), 0, b
#define IOCBN1                           BANKMASK(IOCBN), 1, b
#define IOCBN2                           BANKMASK(IOCBN), 2, b
#define IOCBN3                           BANKMASK(IOCBN), 3, b
#define IOCBN4                           BANKMASK(IOCBN), 4, b
#define IOCBN5                           BANKMASK(IOCBN), 5, b
#define IOCBN6                           BANKMASK(IOCBN), 6, b
#define IOCBN7                           BANKMASK(IOCBN), 7, b
#define IOCBP0                           BANKMASK(IOCBP), 0, b
#define IOCBP1                           BANKMASK(IOCBP), 1, b
#define IOCBP2                           BANKMASK(IOCBP), 2, b
#define IOCBP3                           BANKMASK(IOCBP), 3, b
#define IOCBP4                           BANKMASK(IOCBP), 4, b
#define IOCBP5                           BANKMASK(IOCBP), 5, b
#define IOCBP6                           BANKMASK(IOCBP), 6, b
#define IOCBP7                           BANKMASK(IOCBP), 7, b
#define IOCCF0                           BANKMASK(IOCCF), 0, b
#define IOCCF1                           BANKMASK(IOCCF), 1, b
#define IOCCF2                           BANKMASK(IOCCF), 2, b
#define IOCCF3                           BANKMASK(IOCCF), 3, b
#define IOCCF4                           BANKMASK(IOCCF), 4, b
#define IOCCF5                           BANKMASK(IOCCF), 5, b
#define IOCCF6                           BANKMASK(IOCCF), 6, b
#define IOCCF7                           BANKMASK(IOCCF), 7, b
#define IOCCN0                           BANKMASK(IOCCN), 0, b
#define IOCCN1                           BANKMASK(IOCCN), 1, b
#define IOCCN2                           BANKMASK(IOCCN), 2, b
#define IOCCN3                           BANKMASK(IOCCN), 3, b
#define IOCCN4                           BANKMASK(IOCCN), 4, b
#define IOCCN5                           BANKMASK(IOCCN), 5, b
#define IOCCN6                           BANKMASK(IOCCN), 6, b
#define IOCCN7                           BANKMASK(IOCCN), 7, b
#define IOCCP0                           BANKMASK(IOCCP), 0, b
#define IOCCP1                           BANKMASK(IOCCP), 1, b
#define IOCCP2                           BANKMASK(IOCCP), 2, b
#define IOCCP3                           BANKMASK(IOCCP), 3, b
#define IOCCP4                           BANKMASK(IOCCP), 4, b
#define IOCCP5                           BANKMASK(IOCCP), 5, b
#define IOCCP6                           BANKMASK(IOCCP), 6, b
#define IOCCP7                           BANKMASK(IOCCP), 7, b
#define IOCEF3                           BANKMASK(IOCEF), 3, b
#define IOCEN3                           BANKMASK(IOCEN), 3, b
#define IOCEP3                           BANKMASK(IOCEP), 3, b
#define IOCIE                            BANKMASK(PIE0), 7, a
#define IOCIF                            BANKMASK(PIR0), 7, a
#define IOCIP                            BANKMASK(IPR0), 7, b
#define IOCMD                            BANKMASK(PMD0), 0, b
#define ISRPR0                           BANKMASK(ISRPR), 0, b
#define ISRPR1                           BANKMASK(ISRPR), 1, b
#define ISRPR2                           BANKMASK(ISRPR), 2, b
#define IVMIE                            BANKMASK(C1INTT), 7, b
#define IVMIF                            BANKMASK(C1INTH), 7, b
#define IVTLOCKED                        BANKMASK(IVTLOCK), 0, b
#define LADR0                            BANKMASK(SCANLADRL), 0, b
#define LADR1                            BANKMASK(SCANLADRL), 1, b
#define LADR10                           BANKMASK(SCANLADRH), 2, b
#define LADR11                           BANKMASK(SCANLADRH), 3, b
#define LADR12                           BANKMASK(SCANLADRH), 4, b
#define LADR13                           BANKMASK(SCANLADRH), 5, b
#define LADR14                           BANKMASK(SCANLADRH), 6, b
#define LADR15                           BANKMASK(SCANLADRH), 7, b
#define LADR16                           BANKMASK(SCANLADRU), 0, b
#define LADR17                           BANKMASK(SCANLADRU), 1, b
#define LADR18                           BANKMASK(SCANLADRU), 2, b
#define LADR19                           BANKMASK(SCANLADRU), 3, b
#define LADR2                            BANKMASK(SCANLADRL), 2, b
#define LADR20                           BANKMASK(SCANLADRU), 4, b
#define LADR21                           BANKMASK(SCANLADRU), 5, b
#define LADR3                            BANKMASK(SCANLADRL), 3, b
#define LADR4                            BANKMASK(SCANLADRL), 4, b
#define LADR5                            BANKMASK(SCANLADRL), 5, b
#define LADR6                            BANKMASK(SCANLADRL), 6, b
#define LADR7                            BANKMASK(SCANLADRL), 7, b
#define LADR8                            BANKMASK(SCANLADRH), 0, b
#define LADR9                            BANKMASK(SCANLADRH), 1, b
#define LATA0                            BANKMASK(LATA), 0, a
#define LATA1                            BANKMASK(LATA), 1, a
#define LATA2                            BANKMASK(LATA), 2, a
#define LATA3                            BANKMASK(LATA), 3, a
#define LATA4                            BANKMASK(LATA), 4, a
#define LATA5                            BANKMASK(LATA), 5, a
#define LATA6                            BANKMASK(LATA), 6, a
#define LATA7                            BANKMASK(LATA), 7, a
#define LATB0                            BANKMASK(LATB), 0, a
#define LATB1                            BANKMASK(LATB), 1, a
#define LATB2                            BANKMASK(LATB), 2, a
#define LATB3                            BANKMASK(LATB), 3, a
#define LATB4                            BANKMASK(LATB), 4, a
#define LATB5                            BANKMASK(LATB), 5, a
#define LATB6                            BANKMASK(LATB), 6, a
#define LATB7                            BANKMASK(LATB), 7, a
#define LATC0                            BANKMASK(LATC), 0, a
#define LATC1                            BANKMASK(LATC), 1, a
#define LATC2                            BANKMASK(LATC), 2, a
#define LATC3                            BANKMASK(LATC), 3, a
#define LATC4                            BANKMASK(LATC), 4, a
#define LATC5                            BANKMASK(LATC), 5, a
#define LATC6                            BANKMASK(LATC), 6, a
#define LATC7                            BANKMASK(LATC), 7, a
#define LENDIAN                          BANKMASK(CRCCON0), 1, b
#define LFOEN                            BANKMASK(OSCEN), 4, b
#define LFOR                             BANKMASK(OSCSTAT), 4, b
#define LTH0                             BANKMASK(ADLTHL), 0, b
#define LTH1                             BANKMASK(ADLTHL), 1, b
#define LTH10                            BANKMASK(ADLTHH), 2, b
#define LTH11                            BANKMASK(ADLTHH), 3, b
#define LTH12                            BANKMASK(ADLTHH), 4, b
#define LTH13                            BANKMASK(ADLTHH), 5, b
#define LTH14                            BANKMASK(ADLTHH), 6, b
#define LTH15                            BANKMASK(ADLTHH), 7, b
#define LTH2                             BANKMASK(ADLTHL), 2, b
#define LTH3                             BANKMASK(ADLTHL), 3, b
#define LTH4                             BANKMASK(ADLTHL), 4, b
#define LTH5                             BANKMASK(ADLTHL), 5, b
#define LTH6                             BANKMASK(ADLTHL), 6, b
#define LTH7                             BANKMASK(ADLTHL), 7, b
#define LTH8                             BANKMASK(ADLTHH), 0, b
#define LTH9                             BANKMASK(ADLTHH), 1, b
#define LTHR                             BANKMASK(ADSTAT), 5, b
#define LVDMD                            BANKMASK(PMD0), 5, b
#define MAINPR0                          BANKMASK(MAINPR), 0, b
#define MAINPR1                          BANKMASK(MAINPR), 1, b
#define MAINPR2                          BANKMASK(MAINPR), 2, b
#define MATH                             BANKMASK(ADSTAT), 4, b
#define MC1OUT                           BANKMASK(CMOUT), 0, b
#define MC2OUT                           BANKMASK(CMOUT), 1, b
#define MCLC0                            BANKMASK(CLCDATA), 0, b
#define MCLC1                            BANKMASK(CLCDATA), 1, b
#define MCLC2                            BANKMASK(CLCDATA), 2, b
#define MCLC3                            BANKMASK(CLCDATA), 3, b
#define MCLC4                            BANKMASK(CLCDATA), 4, b
#define MCLC5                            BANKMASK(CLCDATA), 5, b
#define MCLC6                            BANKMASK(CLCDATA), 6, b
#define MCLC7                            BANKMASK(CLCDATA), 7, b
#define MD0                              BANKMASK(ADCON2), 0, b
#define MD1                              BANKMASK(ADCON2), 1, b
#define MD16                             BANKMASK(T0CON0), 4, b
#define MD1BIT                           BANKMASK(MD1CON0), 0, b
#define MD1CH0                           BANKMASK(MD1CARH), 0, b
#define MD1CH1                           BANKMASK(MD1CARH), 1, b
#define MD1CH2                           BANKMASK(MD1CARH), 2, b
#define MD1CH3                           BANKMASK(MD1CARH), 3, b
#define MD1CH4                           BANKMASK(MD1CARH), 4, b
#define MD1CHPOL                         BANKMASK(MD1CON1), 5, b
#define MD1CHSYNC                        BANKMASK(MD1CON1), 4, b
#define MD1CL0                           BANKMASK(MD1CARL), 0, b
#define MD1CL1                           BANKMASK(MD1CARL), 1, b
#define MD1CL2                           BANKMASK(MD1CARL), 2, b
#define MD1CL3                           BANKMASK(MD1CARL), 3, b
#define MD1CL4                           BANKMASK(MD1CARL), 4, b
#define MD1CLPOL                         BANKMASK(MD1CON1), 1, b
#define MD1CLSYNC                        BANKMASK(MD1CON1), 0, b
#define MD1EN                            BANKMASK(MD1CON0), 7, b
#define MD1MS0                           BANKMASK(MD1SRC), 0, b
#define MD1MS1                           BANKMASK(MD1SRC), 1, b
#define MD1MS2                           BANKMASK(MD1SRC), 2, b
#define MD1MS3                           BANKMASK(MD1SRC), 3, b
#define MD1MS4                           BANKMASK(MD1SRC), 4, b
#define MD1MS5                           BANKMASK(MD1SRC), 5, b
#define MD1OPOL                          BANKMASK(MD1CON0), 4, b
#define MD1OUT                           BANKMASK(MD1CON0), 5, b
#define MD2                              BANKMASK(ADCON2), 2, b
#define MDCARHPPS0                       BANKMASK(MD1CARHPPS), 0, b
#define MDCARHPPS1                       BANKMASK(MD1CARHPPS), 1, b
#define MDCARHPPS2                       BANKMASK(MD1CARHPPS), 2, b
#define MDCARHPPS3                       BANKMASK(MD1CARHPPS), 3, b
#define MDCARHPPS4                       BANKMASK(MD1CARHPPS), 4, b
#define MDCARLPPS0                       BANKMASK(MD1CARLPPS), 0, b
#define MDCARLPPS1                       BANKMASK(MD1CARLPPS), 1, b
#define MDCARLPPS2                       BANKMASK(MD1CARLPPS), 2, b
#define MDCARLPPS3                       BANKMASK(MD1CARLPPS), 3, b
#define MDCARLPPS4                       BANKMASK(MD1CARLPPS), 4, b
#define MDR                              BANKMASK(I2C1CON0), 3, b
#define MDSRCPPS0                        BANKMASK(MD1SRCPPS), 0, b
#define MDSRCPPS1                        BANKMASK(MD1SRCPPS), 1, b
#define MDSRCPPS2                        BANKMASK(MD1SRCPPS), 2, b
#define MDSRCPPS3                        BANKMASK(MD1SRCPPS), 3, b
#define MDSRCPPS4                        BANKMASK(MD1SRCPPS), 4, b
#define MEMV                             BANKMASK(PCON1), 1, a
#define MFOEN                            BANKMASK(OSCEN), 5, b
#define MFOR                             BANKMASK(OSCSTAT), 5, b
#define MMA                              BANKMASK(I2C1STAT0), 5, b
#define MODIE                            BANKMASK(C1INTU), 3, b
#define MODIF                            BANKMASK(C1INTL), 3, b
#define MREG                             BANKMASK(SCANCON0), 2, b
#define MS0                              BANKMASK(MD1SRC), 0, b
#define MS1                              BANKMASK(MD1SRC), 1, b
#define MS2                              BANKMASK(MD1SRC), 2, b
#define MS3                              BANKMASK(MD1SRC), 3, b
#define MS4                              BANKMASK(MD1SRC), 4, b
#define MS5                              BANKMASK(MD1SRC), 5, b
#define NACK1IE                          BANKMASK(I2C1ERR), 0, b
#define NACK1IF                          BANKMASK(I2C1ERR), 4, b
#define NACKERR                          BANKMASK(C1BDIAG1U), 2, b
#define NACKIE                           BANKMASK(I2C1ERR), 0, b
#define NACKIF                           BANKMASK(I2C1ERR), 4, b
#define NBIT0ERR                         BANKMASK(C1BDIAG1U), 0, b
#define NBIT1ERR                         BANKMASK(C1BDIAG1U), 1, b
#define NCO1ACC0                         BANKMASK(NCO1ACCL), 0, b
#define NCO1ACC1                         BANKMASK(NCO1ACCL), 1, b
#define NCO1ACC10                        BANKMASK(NCO1ACCH), 2, b
#define NCO1ACC11                        BANKMASK(NCO1ACCH), 3, b
#define NCO1ACC12                        BANKMASK(NCO1ACCH), 4, b
#define NCO1ACC13                        BANKMASK(NCO1ACCH), 5, b
#define NCO1ACC14                        BANKMASK(NCO1ACCH), 6, b
#define NCO1ACC15                        BANKMASK(NCO1ACCH), 7, b
#define NCO1ACC16                        BANKMASK(NCO1ACCU), 0, b
#define NCO1ACC17                        BANKMASK(NCO1ACCU), 1, b
#define NCO1ACC18                        BANKMASK(NCO1ACCU), 2, b
#define NCO1ACC19                        BANKMASK(NCO1ACCU), 3, b
#define NCO1ACC2                         BANKMASK(NCO1ACCL), 2, b
#define NCO1ACC3                         BANKMASK(NCO1ACCL), 3, b
#define NCO1ACC4                         BANKMASK(NCO1ACCL), 4, b
#define NCO1ACC5                         BANKMASK(NCO1ACCL), 5, b
#define NCO1ACC6                         BANKMASK(NCO1ACCL), 6, b
#define NCO1ACC7                         BANKMASK(NCO1ACCL), 7, b
#define NCO1ACC8                         BANKMASK(NCO1ACCH), 0, b
#define NCO1ACC9                         BANKMASK(NCO1ACCH), 1, b
#define NCO1CKS0                         BANKMASK(NCO1CLK), 0, b
#define NCO1CKS1                         BANKMASK(NCO1CLK), 1, b
#define NCO1CKS2                         BANKMASK(NCO1CLK), 2, b
#define NCO1CKS3                         BANKMASK(NCO1CLK), 3, b
#define NCO1EN                           BANKMASK(NCO1CON), 7, b
#define NCO1IE                           BANKMASK(PIE6), 3, a
#define NCO1IF                           BANKMASK(PIR6), 3, a
#define NCO1INC0                         BANKMASK(NCO1INCL), 0, b
#define NCO1INC1                         BANKMASK(NCO1INCL), 1, b
#define NCO1INC10                        BANKMASK(NCO1INCH), 2, b
#define NCO1INC11                        BANKMASK(NCO1INCH), 3, b
#define NCO1INC12                        BANKMASK(NCO1INCH), 4, b
#define NCO1INC13                        BANKMASK(NCO1INCH), 5, b
#define NCO1INC14                        BANKMASK(NCO1INCH), 6, b
#define NCO1INC15                        BANKMASK(NCO1INCH), 7, b
#define NCO1INC16                        BANKMASK(NCO1INCU), 0, b
#define NCO1INC17                        BANKMASK(NCO1INCU), 1, b
#define NCO1INC18                        BANKMASK(NCO1INCU), 2, b
#define NCO1INC19                        BANKMASK(NCO1INCU), 3, b
#define NCO1INC2                         BANKMASK(NCO1INCL), 2, b
#define NCO1INC3                         BANKMASK(NCO1INCL), 3, b
#define NCO1INC4                         BANKMASK(NCO1INCL), 4, b
#define NCO1INC5                         BANKMASK(NCO1INCL), 5, b
#define NCO1INC6                         BANKMASK(NCO1INCL), 6, b
#define NCO1INC7                         BANKMASK(NCO1INCL), 7, b
#define NCO1INC8                         BANKMASK(NCO1INCH), 0, b
#define NCO1INC9                         BANKMASK(NCO1INCH), 1, b
#define NCO1IP                           BANKMASK(IPR6), 3, b
#define NCO1MD                           BANKMASK(PMD4), 0, b
#define NCO1OUT                          BANKMASK(NCO1CON), 5, b
#define NCO1PFM                          BANKMASK(NCO1CON), 0, b
#define NCO1POL                          BANKMASK(NCO1CON), 4, b
#define NCO1PWS0                         BANKMASK(NCO1CLK), 5, b
#define NCO1PWS1                         BANKMASK(NCO1CLK), 6, b
#define NCO1PWS2                         BANKMASK(NCO1CLK), 7, b
#define NCO2ACC0                         BANKMASK(NCO2ACCL), 0, b
#define NCO2ACC1                         BANKMASK(NCO2ACCL), 1, b
#define NCO2ACC10                        BANKMASK(NCO2ACCH), 2, b
#define NCO2ACC11                        BANKMASK(NCO2ACCH), 3, b
#define NCO2ACC12                        BANKMASK(NCO2ACCH), 4, b
#define NCO2ACC13                        BANKMASK(NCO2ACCH), 5, b
#define NCO2ACC14                        BANKMASK(NCO2ACCH), 6, b
#define NCO2ACC15                        BANKMASK(NCO2ACCH), 7, b
#define NCO2ACC16                        BANKMASK(NCO2ACCU), 0, b
#define NCO2ACC17                        BANKMASK(NCO2ACCU), 1, b
#define NCO2ACC18                        BANKMASK(NCO2ACCU), 2, b
#define NCO2ACC19                        BANKMASK(NCO2ACCU), 3, b
#define NCO2ACC2                         BANKMASK(NCO2ACCL), 2, b
#define NCO2ACC3                         BANKMASK(NCO2ACCL), 3, b
#define NCO2ACC4                         BANKMASK(NCO2ACCL), 4, b
#define NCO2ACC5                         BANKMASK(NCO2ACCL), 5, b
#define NCO2ACC6                         BANKMASK(NCO2ACCL), 6, b
#define NCO2ACC7                         BANKMASK(NCO2ACCL), 7, b
#define NCO2ACC8                         BANKMASK(NCO2ACCH), 0, b
#define NCO2ACC9                         BANKMASK(NCO2ACCH), 1, b
#define NCO2CKS0                         BANKMASK(NCO2CLK), 0, b
#define NCO2CKS1                         BANKMASK(NCO2CLK), 1, b
#define NCO2CKS2                         BANKMASK(NCO2CLK), 2, b
#define NCO2CKS3                         BANKMASK(NCO2CLK), 3, b
#define NCO2EN                           BANKMASK(NCO2CON), 7, b
