GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
#define U1RXFOIF                         BANKMASK(U1ERRIR), 1, b
#define U1RXIDL                          BANKMASK(U1FIFO), 3, b
#define U1RXIE                           BANKMASK(PIE4), 0, a
#define U1RXIF                           BANKMASK(PIR4), 0, a
#define U1RXIP                           BANKMASK(IPR4), 0, b
#define U1RXPOL                          BANKMASK(U1CON2), 6, b
#define U1RXPPS0                         BANKMASK(U1RXPPS), 0, b
#define U1RXPPS1                         BANKMASK(U1RXPPS), 1, b
#define U1RXPPS2                         BANKMASK(U1RXPPS), 2, b
#define U1RXPPS3                         BANKMASK(U1RXPPS), 3, b
#define U1RXPPS4                         BANKMASK(U1RXPPS), 4, b
#define U1RXPPS5                         BANKMASK(U1RXPPS), 5, b
#define U1SENDB                          BANKMASK(U1CON1), 0, b
#define U1STP0                           BANKMASK(U1CON2), 4, b
#define U1STP1                           BANKMASK(U1CON2), 5, b
#define U1STPMD                          BANKMASK(U1FIFO), 6, b
#define U1TXBE                           BANKMASK(U1FIFO), 5, b
#define U1TXBF                           BANKMASK(U1FIFO), 4, b
#define U1TXCIE                          BANKMASK(U1ERRIE), 0, b
#define U1TXCIF                          BANKMASK(U1ERRIR), 0, b
#define U1TXEN                           BANKMASK(U1CON0), 5, b
#define U1TXIE                           BANKMASK(PIE4), 1, a
#define U1TXIF                           BANKMASK(PIR4), 1, a
#define U1TXIP                           BANKMASK(IPR4), 1, b
#define U1TXMTIE                         BANKMASK(U1ERRIE), 7, b
#define U1TXMTIF                         BANKMASK(U1ERRIR), 7, b
#define U1TXPOL                          BANKMASK(U1CON2), 2, b
#define U1TXWRE                          BANKMASK(U1FIFO), 7, b
#define U1WUE                            BANKMASK(U1CON1), 4, b
#define U1WUIF                           BANKMASK(U1UIR), 7, b
#define U1XON                            BANKMASK(U1FIFO), 2, b
#define U2ABDEN                          BANKMASK(U2CON0), 6, b
#define U2ABDIE                          BANKMASK(U2UIR), 2, b
#define U2ABDIF                          BANKMASK(U2UIR), 6, b
#define U2ABDOVE                         BANKMASK(U2ERRIE), 5, b
#define U2ABDOVF                         BANKMASK(U2ERRIR), 5, b
#define U2BRGS                           BANKMASK(U2CON0), 7, b
#define U2BRKOVR                         BANKMASK(U2CON1), 1, b
#define U2C0EN                           BANKMASK(U2CON2), 3, b
#define U2CERIE                          BANKMASK(U2ERRIE), 4, b
#define U2CERIF                          BANKMASK(U2ERRIR), 4, b
#define U2CTSPPS0                        BANKMASK(U2CTSPPS), 0, b
#define U2CTSPPS1                        BANKMASK(U2CTSPPS), 1, b
#define U2CTSPPS2                        BANKMASK(U2CTSPPS), 2, b
#define U2CTSPPS3                        BANKMASK(U2CTSPPS), 3, b
#define U2CTSPPS4                        BANKMASK(U2CTSPPS), 4, b
#define U2EIE                            BANKMASK(PIE8), 2, a
#define U2EIF                            BANKMASK(PIR8), 2, a
#define U2EIP                            BANKMASK(IPR8), 2, b
#define U2FERIE                          BANKMASK(U2ERRIE), 3, b
#define U2FERIF                          BANKMASK(U2ERRIR), 3, b
#define U2FLO0                           BANKMASK(U2CON2), 0, b
#define U2FLO1                           BANKMASK(U2CON2), 1, b
#define U2IE                             BANKMASK(PIE8), 3, a
#define U2IF                             BANKMASK(PIR8), 3, a
#define U2IP                             BANKMASK(IPR8), 3, b
#define U2MD                             BANKMASK(PMD6), 4, b
#define U2MODE0                          BANKMASK(U2CON0), 0, b
#define U2MODE1                          BANKMASK(U2CON0), 1, b
#define U2MODE2                          BANKMASK(U2CON0), 2, b
#define U2MODE3                          BANKMASK(U2CON0), 3, b
#define U2ON                             BANKMASK(U2CON1), 7, b
#define U2PERIE                          BANKMASK(U2ERRIE), 6, b
#define U2PERIF                          BANKMASK(U2ERRIR), 6, b
#define U2RCIDL                          BANKMASK(U2FIFO), 3, b
#define U2RUNOVF                         BANKMASK(U2CON2), 7, b
#define U2RXBE                           BANKMASK(U2FIFO), 1, b
#define U2RXBF                           BANKMASK(U2FIFO), 0, b
#define U2RXBIMD                         BANKMASK(U2CON1), 3, b
#define U2RXBKIE                         BANKMASK(U2ERRIE), 2, b
#define U2RXBKIF                         BANKMASK(U2ERRIR), 2, b
#define U2RXEN                           BANKMASK(U2CON0), 4, b
#define U2RXFOIE                         BANKMASK(U2ERRIE), 1, b
#define U2RXFOIF                         BANKMASK(U2ERRIR), 1, b
#define U2RXIDL                          BANKMASK(U2FIFO), 3, b
#define U2RXIE                           BANKMASK(PIE8), 0, a
#define U2RXIF                           BANKMASK(PIR8), 0, a
#define U2RXIP                           BANKMASK(IPR8), 0, b
#define U2RXPOL                          BANKMASK(U2CON2), 6, b
#define U2RXPPS0                         BANKMASK(U2RXPPS), 0, b
#define U2RXPPS1                         BANKMASK(U2RXPPS), 1, b
#define U2RXPPS2                         BANKMASK(U2RXPPS), 2, b
#define U2RXPPS3                         BANKMASK(U2RXPPS), 3, b
#define U2RXPPS4                         BANKMASK(U2RXPPS), 4, b
#define U2SENDB                          BANKMASK(U2CON1), 0, b
#define U2STP0                           BANKMASK(U2CON2), 4, b
#define U2STP1                           BANKMASK(U2CON2), 5, b
#define U2STPMD                          BANKMASK(U2FIFO), 6, b
#define U2TXBE                           BANKMASK(U2FIFO), 5, b
#define U2TXBF                           BANKMASK(U2FIFO), 4, b
#define U2TXCIE                          BANKMASK(U2ERRIE), 0, b
#define U2TXCIF                          BANKMASK(U2ERRIR), 0, b
#define U2TXEN                           BANKMASK(U2CON0), 5, b
#define U2TXIE                           BANKMASK(PIE8), 1, a
#define U2TXIF                           BANKMASK(PIR8), 1, a
#define U2TXIP                           BANKMASK(IPR8), 1, b
#define U2TXMTIE                         BANKMASK(U2ERRIE), 7, b
#define U2TXMTIF                         BANKMASK(U2ERRIR), 7, b
#define U2TXPOL                          BANKMASK(U2CON2), 2, b
#define U2TXWRE                          BANKMASK(U2FIFO), 7, b
#define U2WUE                            BANKMASK(U2CON1), 4, b
#define U2WUIF                           BANKMASK(U2UIR), 7, b
#define U2XON                            BANKMASK(U2FIFO), 2, b
#define U3ABDEN                          BANKMASK(U3CON0), 6, b
#define U3ABDIE                          BANKMASK(U3UIR), 2, b
#define U3ABDIF                          BANKMASK(U3UIR), 6, b
#define U3ABDOVE                         BANKMASK(U3ERRIE), 5, b
#define U3ABDOVF                         BANKMASK(U3ERRIR), 5, b
#define U3BRGS                           BANKMASK(U3CON0), 7, b
#define U3BRKOVR                         BANKMASK(U3CON1), 1, b
#define U3CERIE                          BANKMASK(U3ERRIE), 4, b
#define U3CERIF                          BANKMASK(U3ERRIR), 4, b
#define U3CTSPPS0                        BANKMASK(U3CTSPPS), 0, b
#define U3CTSPPS1                        BANKMASK(U3CTSPPS), 1, b
#define U3CTSPPS2                        BANKMASK(U3CTSPPS), 2, b
#define U3CTSPPS3                        BANKMASK(U3CTSPPS), 3, b
#define U3CTSPPS4                        BANKMASK(U3CTSPPS), 4, b
#define U3CTSPPS5                        BANKMASK(U3CTSPPS), 5, b
#define U3EIE                            BANKMASK(PIE9), 2, a
#define U3EIF                            BANKMASK(PIR9), 2, a
#define U3EIP                            BANKMASK(IPR9), 2, b
#define U3FERIE                          BANKMASK(U3ERRIE), 3, b
#define U3FERIF                          BANKMASK(U3ERRIR), 3, b
#define U3FLO0                           BANKMASK(U3CON2), 0, b
#define U3FLO1                           BANKMASK(U3CON2), 1, b
#define U3IE                             BANKMASK(PIE9), 3, a
#define U3IF                             BANKMASK(PIR9), 3, a
#define U3IP                             BANKMASK(IPR9), 3, b
#define U3MD                             BANKMASK(PMD6), 5, b
#define U3MODE0                          BANKMASK(U3CON0), 0, b
#define U3MODE1                          BANKMASK(U3CON0), 1, b
#define U3MODE2                          BANKMASK(U3CON0), 2, b
#define U3ON                             BANKMASK(U3CON1), 7, b
#define U3PERIE                          BANKMASK(U3ERRIE), 6, b
#define U3PERIF                          BANKMASK(U3ERRIR), 6, b
#define U3RCIDL                          BANKMASK(U3FIFO), 3, b
#define U3RUNOVF                         BANKMASK(U3CON2), 7, b
#define U3RXBE                           BANKMASK(U3FIFO), 1, b
#define U3RXBF                           BANKMASK(U3FIFO), 0, b
#define U3RXBIMD                         BANKMASK(U3CON1), 3, b
#define U3RXBKIE                         BANKMASK(U3ERRIE), 2, b
#define U3RXBKIF                         BANKMASK(U3ERRIR), 2, b
#define U3RXEN                           BANKMASK(U3CON0), 4, b
#define U3RXFOIE                         BANKMASK(U3ERRIE), 1, b
#define U3RXFOIF                         BANKMASK(U3ERRIR), 1, b
#define U3RXIDL                          BANKMASK(U3FIFO), 3, b
#define U3RXIE                           BANKMASK(PIE9), 0, a
#define U3RXIF                           BANKMASK(PIR9), 0, a
#define U3RXIP                           BANKMASK(IPR9), 0, b
#define U3RXPOL                          BANKMASK(U3CON2), 6, b
#define U3RXPPS0                         BANKMASK(U3RXPPS), 0, b
#define U3RXPPS1                         BANKMASK(U3RXPPS), 1, b
#define U3RXPPS2                         BANKMASK(U3RXPPS), 2, b
#define U3RXPPS3                         BANKMASK(U3RXPPS), 3, b
#define U3RXPPS4                         BANKMASK(U3RXPPS), 4, b
#define U3RXPPS5                         BANKMASK(U3RXPPS), 5, b
#define U3SENDB                          BANKMASK(U3CON1), 0, b
#define U3STP0                           BANKMASK(U3CON2), 4, b
#define U3STP1                           BANKMASK(U3CON2), 5, b
#define U3STPMD                          BANKMASK(U3FIFO), 6, b
#define U3TXBE                           BANKMASK(U3FIFO), 5, b
#define U3TXBF                           BANKMASK(U3FIFO), 4, b
#define U3TXCIE                          BANKMASK(U3ERRIE), 0, b
#define U3TXCIF                          BANKMASK(U3ERRIR), 0, b
#define U3TXEN                           BANKMASK(U3CON0), 5, b
#define U3TXIE                           BANKMASK(PIE9), 1, a
#define U3TXIF                           BANKMASK(PIR9), 1, a
#define U3TXIP                           BANKMASK(IPR9), 1, b
#define U3TXMTIE                         BANKMASK(U3ERRIE), 7, b
#define U3TXMTIF                         BANKMASK(U3ERRIR), 7, b
#define U3TXPOL                          BANKMASK(U3CON2), 2, b
#define U3TXWRE                          BANKMASK(U3FIFO), 7, b
#define U3WUE                            BANKMASK(U3CON1), 4, b
#define U3WUIF                           BANKMASK(U3UIR), 7, b
#define U3XON                            BANKMASK(U3FIFO), 2, b
#define U4ABDEN                          BANKMASK(U4CON0), 6, b
#define U4ABDIE                          BANKMASK(U4UIR), 2, b
#define U4ABDIF                          BANKMASK(U4UIR), 6, b
#define U4ABDOVE                         BANKMASK(U4ERRIE), 5, b
#define U4ABDOVF                         BANKMASK(U4ERRIR), 5, b
#define U4BRGS                           BANKMASK(U4CON0), 7, b
#define U4BRKOVR                         BANKMASK(U4CON1), 1, b
#define U4CERIE                          BANKMASK(U4ERRIE), 4, b
#define U4CERIF                          BANKMASK(U4ERRIR), 4, b
#define U4CTSPPS0                        BANKMASK(U4CTSPPS), 0, b
#define U4CTSPPS1                        BANKMASK(U4CTSPPS), 1, b
#define U4CTSPPS2                        BANKMASK(U4CTSPPS), 2, b
#define U4CTSPPS3                        BANKMASK(U4CTSPPS), 3, b
#define U4CTSPPS4                        BANKMASK(U4CTSPPS), 4, b
#define U4EIE                            BANKMASK(PIE12), 2, a
#define U4EIF                            BANKMASK(PIR12), 2, a
#define U4EIP                            BANKMASK(IPR12), 2, b
#define U4FERIE                          BANKMASK(U4ERRIE), 3, b
#define U4FERIF                          BANKMASK(U4ERRIR), 3, b
#define U4FLO0                           BANKMASK(U4CON2), 0, b
#define U4FLO1                           BANKMASK(U4CON2), 1, b
#define U4IE                             BANKMASK(PIE12), 3, a
#define U4IF                             BANKMASK(PIR12), 3, a
#define U4IP                             BANKMASK(IPR12), 3, b
#define U4MD                             BANKMASK(PMD6), 6, b
#define U4MODE0                          BANKMASK(U4CON0), 0, b
#define U4MODE1                          BANKMASK(U4CON0), 1, b
#define U4MODE2                          BANKMASK(U4CON0), 2, b
#define U4ON                             BANKMASK(U4CON1), 7, b
#define U4PERIE                          BANKMASK(U4ERRIE), 6, b
#define U4PERIF                          BANKMASK(U4ERRIR), 6, b
#define U4RCIDL                          BANKMASK(U4FIFO), 3, b
#define U4RUNOVF                         BANKMASK(U4CON2), 7, b
#define U4RXBE                           BANKMASK(U4FIFO), 1, b
#define U4RXBF                           BANKMASK(U4FIFO), 0, b
#define U4RXBIMD                         BANKMASK(U4CON1), 3, b
#define U4RXBKIE                         BANKMASK(U4ERRIE), 2, b
#define U4RXBKIF                         BANKMASK(U4ERRIR), 2, b
#define U4RXEN                           BANKMASK(U4CON0), 4, b
#define U4RXFOIE                         BANKMASK(U4ERRIE), 1, b
#define U4RXFOIF                         BANKMASK(U4ERRIR), 1, b
#define U4RXIDL                          BANKMASK(U4FIFO), 3, b
#define U4RXIE                           BANKMASK(PIE12), 0, a
#define U4RXIF                           BANKMASK(PIR12), 0, a
#define U4RXIP                           BANKMASK(IPR12), 0, b
#define U4RXPOL                          BANKMASK(U4CON2), 6, b
#define U4RXPPS0                         BANKMASK(U4RXPPS), 0, b
#define U4RXPPS1                         BANKMASK(U4RXPPS), 1, b
#define U4RXPPS2                         BANKMASK(U4RXPPS), 2, b
#define U4RXPPS3                         BANKMASK(U4RXPPS), 3, b
#define U4RXPPS4                         BANKMASK(U4RXPPS), 4, b
#define U4SENDB                          BANKMASK(U4CON1), 0, b
#define U4STP0                           BANKMASK(U4CON2), 4, b
#define U4STP1                           BANKMASK(U4CON2), 5, b
#define U4STPMD                          BANKMASK(U4FIFO), 6, b
#define U4TXBE                           BANKMASK(U4FIFO), 5, b
#define U4TXBF                           BANKMASK(U4FIFO), 4, b
#define U4TXCIE                          BANKMASK(U4ERRIE), 0, b
#define U4TXCIF                          BANKMASK(U4ERRIR), 0, b
#define U4TXEN                           BANKMASK(U4CON0), 5, b
#define U4TXIE                           BANKMASK(PIE12), 1, a
#define U4TXIF                           BANKMASK(PIR12), 1, a
#define U4TXIP                           BANKMASK(IPR12), 1, b
#define U4TXMTIE                         BANKMASK(U4ERRIE), 7, b
#define U4TXMTIF                         BANKMASK(U4ERRIR), 7, b
#define U4TXPOL                          BANKMASK(U4CON2), 2, b
#define U4TXWRE                          BANKMASK(U4FIFO), 7, b
#define U4WUE                            BANKMASK(U4CON1), 4, b
#define U4WUIF                           BANKMASK(U4UIR), 7, b
#define U4XON                            BANKMASK(U4FIFO), 2, b
#define U5ABDEN                          BANKMASK(U5CON0), 6, b
#define U5ABDIE                          BANKMASK(U5UIR), 2, b
#define U5ABDIF                          BANKMASK(U5UIR), 6, b
#define U5ABDOVE                         BANKMASK(U5ERRIE), 5, b
#define U5ABDOVF                         BANKMASK(U5ERRIR), 5, b
#define U5BRGS                           BANKMASK(U5CON0), 7, b
#define U5BRKOVR                         BANKMASK(U5CON1), 1, b
#define U5CERIE                          BANKMASK(U5ERRIE), 4, b
#define U5CERIF                          BANKMASK(U5ERRIR), 4, b
#define U5CTSPPS0                        BANKMASK(U5CTSPPS), 0, b
#define U5CTSPPS1                        BANKMASK(U5CTSPPS), 1, b
#define U5CTSPPS2                        BANKMASK(U5CTSPPS), 2, b
#define U5CTSPPS3                        BANKMASK(U5CTSPPS), 3, b
#define U5CTSPPS4                        BANKMASK(U5CTSPPS), 4, b
#define U5CTSPPS5                        BANKMASK(U5CTSPPS), 5, b
#define U5EIE                            BANKMASK(PIE13), 2, a
#define U5EIF                            BANKMASK(PIR13), 2, a
#define U5EIP                            BANKMASK(IPR13), 2, b
#define U5FERIE                          BANKMASK(U5ERRIE), 3, b
#define U5FERIF                          BANKMASK(U5ERRIR), 3, b
#define U5FLO0                           BANKMASK(U5CON2), 0, b
#define U5FLO1                           BANKMASK(U5CON2), 1, b
#define U5IE                             BANKMASK(PIE13), 3, a
#define U5IF                             BANKMASK(PIR13), 3, a
#define U5IP                             BANKMASK(IPR13), 3, b
#define U5MD                             BANKMASK(PMD6), 7, b
#define U5MODE0                          BANKMASK(U5CON0), 0, b
#define U5MODE1                          BANKMASK(U5CON0), 1, b
#define U5MODE2                          BANKMASK(U5CON0), 2, b
#define U5ON                             BANKMASK(U5CON1), 7, b
#define U5PERIE                          BANKMASK(U5ERRIE), 6, b
#define U5PERIF                          BANKMASK(U5ERRIR), 6, b
#define U5RCIDL                          BANKMASK(U5FIFO), 3, b
#define U5RUNOVF                         BANKMASK(U5CON2), 7, b
#define U5RXBE                           BANKMASK(U5FIFO), 1, b
#define U5RXBF                           BANKMASK(U5FIFO), 0, b
#define U5RXBIMD                         BANKMASK(U5CON1), 3, b
#define U5RXBKIE                         BANKMASK(U5ERRIE), 2, b
#define U5RXBKIF                         BANKMASK(U5ERRIR), 2, b
#define U5RXEN                           BANKMASK(U5CON0), 4, b
#define U5RXFOIE                         BANKMASK(U5ERRIE), 1, b
#define U5RXFOIF                         BANKMASK(U5ERRIR), 1, b
#define U5RXIDL                          BANKMASK(U5FIFO), 3, b
#define U5RXIE                           BANKMASK(PIE13), 0, a
#define U5RXIF                           BANKMASK(PIR13), 0, a
#define U5RXIP                           BANKMASK(IPR13), 0, b
#define U5RXPOL                          BANKMASK(U5CON2), 6, b
#define U5RXPPS0                         BANKMASK(U5RXPPS), 0, b
#define U5RXPPS1                         BANKMASK(U5RXPPS), 1, b
#define U5RXPPS2                         BANKMASK(U5RXPPS), 2, b
#define U5RXPPS3                         BANKMASK(U5RXPPS), 3, b
#define U5RXPPS4                         BANKMASK(U5RXPPS), 4, b
#define U5RXPPS5                         BANKMASK(U5RXPPS), 5, b
#define U5SENDB                          BANKMASK(U5CON1), 0, b
#define U5STP0                           BANKMASK(U5CON2), 4, b
#define U5STP1                           BANKMASK(U5CON2), 5, b
#define U5STPMD                          BANKMASK(U5FIFO), 6, b
#define U5TXBE                           BANKMASK(U5FIFO), 5, b
#define U5TXBF                           BANKMASK(U5FIFO), 4, b
#define U5TXCIE                          BANKMASK(U5ERRIE), 0, b
#define U5TXCIF                          BANKMASK(U5ERRIR), 0, b
#define U5TXEN                           BANKMASK(U5CON0), 5, b
#define U5TXIE                           BANKMASK(PIE13), 1, a
#define U5TXIF                           BANKMASK(PIR13), 1, a
#define U5TXIP                           BANKMASK(IPR13), 1, b
#define U5TXMTIE                         BANKMASK(U5ERRIE), 7, b
#define U5TXMTIF                         BANKMASK(U5ERRIR), 7, b
#define U5TXPOL                          BANKMASK(U5CON2), 2, b
#define U5TXWRE                          BANKMASK(U5FIFO), 7, b
#define U5WUE                            BANKMASK(U5CON1), 4, b
#define U5WUIF                           BANKMASK(U5UIR), 7, b
#define U5XON                            BANKMASK(U5FIFO), 2, b
#define UTH0                             BANKMASK(ADUTHL), 0, b
#define UTH1                             BANKMASK(ADUTHL), 1, b
#define UTH10                            BANKMASK(ADUTHH), 2, b
#define UTH11                            BANKMASK(ADUTHH), 3, b
#define UTH12                            BANKMASK(ADUTHH), 4, b
#define UTH13                            BANKMASK(ADUTHH), 5, b
#define UTH14                            BANKMASK(ADUTHH), 6, b
#define UTH15                            BANKMASK(ADUTHH), 7, b
#define UTH2                             BANKMASK(ADUTHL), 2, b
#define UTH3                             BANKMASK(ADUTHL), 3, b
#define UTH4                             BANKMASK(ADUTHL), 4, b
#define UTH5                             BANKMASK(ADUTHL), 5, b
#define UTH6                             BANKMASK(ADUTHL), 6, b
#define UTH7                             BANKMASK(ADUTHL), 7, b
#define UTH8                             BANKMASK(ADUTHH), 0, b
#define UTH9                             BANKMASK(ADUTHH), 1, b
#define UTHR                             BANKMASK(ADSTAT), 6, b
#define VREGPM0                          BANKMASK(VREGCON), 0, b
#define VREGPM1                          BANKMASK(VREGCON), 1, b
#define WAKFIL                           BANKMASK(C1CONH), 0, b
#define WAKIE                            BANKMASK(C1INTT), 6, b
#define WAKIF                            BANKMASK(C1INTH), 6, b
#define WDTCS0                           BANKMASK(WDTCON1), 4, b
#define WDTCS1                           BANKMASK(WDTCON1), 5, b
#define WDTCS2                           BANKMASK(WDTCON1), 6, b
#define WDTPS0                           BANKMASK(WDTCON0), 1, b
#define WDTPS1                           BANKMASK(WDTCON0), 2, b
#define WDTPS2                           BANKMASK(WDTCON0), 3, b
#define WDTPS3                           BANKMASK(WDTCON0), 4, b
#define WDTPS4                           BANKMASK(WDTCON0), 5, b
#define WDTPSCNT0                        BANKMASK(WDTPSL), 0, b
#define WDTPSCNT1                        BANKMASK(WDTPSL), 1, b
#define WDTPSCNT10                       BANKMASK(WDTPSH), 2, b
#define WDTPSCNT11                       BANKMASK(WDTPSH), 3, b
#define WDTPSCNT12                       BANKMASK(WDTPSH), 4, b
#define WDTPSCNT13                       BANKMASK(WDTPSH), 5, b
#define WDTPSCNT14                       BANKMASK(WDTPSH), 6, b
#define WDTPSCNT15                       BANKMASK(WDTPSH), 7, b
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0, b
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1, b
#define WDTPSCNT2                        BANKMASK(WDTPSL), 2, b
#define WDTPSCNT3                        BANKMASK(WDTPSL), 3, b
#define WDTPSCNT4                        BANKMASK(WDTPSL), 4, b
#define WDTPSCNT5                        BANKMASK(WDTPSL), 5, b
#define WDTPSCNT6                        BANKMASK(WDTPSL), 6, b
#define WDTPSCNT7                        BANKMASK(WDTPSL), 7, b
#define WDTPSCNT8                        BANKMASK(WDTPSH), 0, b
#define WDTPSCNT9                        BANKMASK(WDTPSH), 1, b
#define WDTSEN                           BANKMASK(WDTCON0), 0, b
#define WDTSTATE                         BANKMASK(WDTTMR), 2, b
#define WDTTMR0                          BANKMASK(WDTTMR), 3, b
#define WDTTMR1                          BANKMASK(WDTTMR), 4, b
#define WDTTMR2                          BANKMASK(WDTTMR), 5, b
#define WDTTMR3                          BANKMASK(WDTTMR), 6, b
#define WDTTMR4                          BANKMASK(WDTTMR), 7, b
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0, b
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1, b
