GopalSaraf/Practicals/PSDL/include/proc/pic18f27q83.inc
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2, b
#define WDTWV                            BANKMASK(PCON0), 5, a
#define WFT0                             BANKMASK(C1CONH), 1, b
#define WFT1                             BANKMASK(C1CONH), 2, b
#define WINDOW0                          BANKMASK(WDTCON1), 0, b
#define WINDOW1                          BANKMASK(WDTCON1), 1, b
#define WINDOW2                          BANKMASK(WDTCON1), 2, b
#define WPOL                             BANKMASK(SMT1CON0), 4, b
#define WPUA0                            BANKMASK(WPUA), 0, b
#define WPUA1                            BANKMASK(WPUA), 1, b
#define WPUA2                            BANKMASK(WPUA), 2, b
#define WPUA3                            BANKMASK(WPUA), 3, b
#define WPUA4                            BANKMASK(WPUA), 4, b
#define WPUA5                            BANKMASK(WPUA), 5, b
#define WPUA6                            BANKMASK(WPUA), 6, b
#define WPUA7                            BANKMASK(WPUA), 7, b
#define WPUB0                            BANKMASK(WPUB), 0, b
#define WPUB1                            BANKMASK(WPUB), 1, b
#define WPUB2                            BANKMASK(WPUB), 2, b
#define WPUB3                            BANKMASK(WPUB), 3, b
#define WPUB4                            BANKMASK(WPUB), 4, b
#define WPUB5                            BANKMASK(WPUB), 5, b
#define WPUB6                            BANKMASK(WPUB), 6, b
#define WPUB7                            BANKMASK(WPUB), 7, b
#define WPUC0                            BANKMASK(WPUC), 0, b
#define WPUC1                            BANKMASK(WPUC), 1, b
#define WPUC2                            BANKMASK(WPUC), 2, b
#define WPUC3                            BANKMASK(WPUC), 3, b
#define WPUC4                            BANKMASK(WPUC), 4, b
#define WPUC5                            BANKMASK(WPUC), 5, b
#define WPUC6                            BANKMASK(WPUC), 6, b
#define WPUC7                            BANKMASK(WPUC), 7, b
#define WPUE3                            BANKMASK(WPUE), 3, b
#define WR1IE                            BANKMASK(I2C1PIE), 4, b
#define WR1IF                            BANKMASK(I2C1PIR), 4, b
#define WRERR                            BANKMASK(NVMCON1), 7, b
#define WRIE                             BANKMASK(I2C1PIE), 4, b
#define WRIF                             BANKMASK(I2C1PIR), 4, b
#define WS                               BANKMASK(SMT1STAT), 1, b
#define WSEL0                            BANKMASK(SMT1WIN), 0, b
#define WSEL1                            BANKMASK(SMT1WIN), 1, b
#define WSEL2                            BANKMASK(SMT1WIN), 2, b
#define WSEL3                            BANKMASK(SMT1WIN), 3, b
#define WSEL4                            BANKMASK(SMT1WIN), 4, b
#define XIP                              BANKMASK(DMAnCON0), 0, b
#define XOR0                             BANKMASK(CRCXORL), 0, b
#define XOR1                             BANKMASK(CRCXORL), 1, b
#define XOR10                            BANKMASK(CRCXORH), 2, b
#define XOR11                            BANKMASK(CRCXORH), 3, b
#define XOR12                            BANKMASK(CRCXORH), 4, b
#define XOR13                            BANKMASK(CRCXORH), 5, b
#define XOR14                            BANKMASK(CRCXORH), 6, b
#define XOR15                            BANKMASK(CRCXORH), 7, b
#define XOR16                            BANKMASK(CRCXORU), 0, b
#define XOR17                            BANKMASK(CRCXORU), 1, b
#define XOR18                            BANKMASK(CRCXORU), 2, b
#define XOR19                            BANKMASK(CRCXORU), 3, b
#define XOR2                             BANKMASK(CRCXORL), 2, b
#define XOR20                            BANKMASK(CRCXORU), 4, b
#define XOR21                            BANKMASK(CRCXORU), 5, b
#define XOR22                            BANKMASK(CRCXORU), 6, b
#define XOR23                            BANKMASK(CRCXORU), 7, b
#define XOR24                            BANKMASK(CRCXORT), 0, b
#define XOR25                            BANKMASK(CRCXORT), 1, b
#define XOR26                            BANKMASK(CRCXORT), 2, b
#define XOR27                            BANKMASK(CRCXORT), 3, b
#define XOR28                            BANKMASK(CRCXORT), 4, b
#define XOR29                            BANKMASK(CRCXORT), 5, b
#define XOR3                             BANKMASK(CRCXORL), 3, b
#define XOR30                            BANKMASK(CRCXORT), 6, b
#define XOR31                            BANKMASK(CRCXORT), 7, b
#define XOR4                             BANKMASK(CRCXORL), 4, b
#define XOR5                             BANKMASK(CRCXORL), 5, b
#define XOR6                             BANKMASK(CRCXORL), 6, b
#define XOR7                             BANKMASK(CRCXORL), 7, b
#define XOR8                             BANKMASK(CRCXORH), 0, b
#define XOR9                             BANKMASK(CRCXORH), 1, b
#define ZCDIE                            BANKMASK(PIE1), 1, a
#define ZCDIF                            BANKMASK(PIR1), 1, a
#define ZCDINTN                          BANKMASK(ZCDCON), 0, b
#define ZCDINTP                          BANKMASK(ZCDCON), 1, b
#define ZCDIP                            BANKMASK(IPR1), 1, b
#define ZCDMD                            BANKMASK(PMD3), 0, b
#define ZCDOUT                           BANKMASK(ZCDCON), 5, b
#define ZCDPOL                           BANKMASK(ZCDCON), 4, b
#define ZCDSEN                           BANKMASK(ZCDCON), 7, b
#define nBOR                             BANKMASK(PCON0), 0, a
#define nDONE                            BANKMASK(NVMCON0), 0, b
#define nMEMV                            BANKMASK(PCON1), 1, a
#define nPOR                             BANKMASK(PCON0), 1, a
#define nRI                              BANKMASK(PCON0), 2, a
#define nRMCLR                           BANKMASK(PCON0), 3, a
#define nRWDT                            BANKMASK(PCON0), 4, a
#define nWDTWV                           BANKMASK(PCON0), 5, a

